{
  "22350":[
    "I don't have access to an outdoor hose to rinse my car, so I greatly appreciate that water isn't required with the Griot's washing kit.",
    "This is a great substitute for washing your car with a bucket and hose, not least because you don't have runoff and wasted water and wet feet.",
    "First I'm not a big fan of washing cars without water, if you can't first rinse off the heavy loose dirt with water you'll end up grinding the dirt into the paint leaving marks that don't go away.",
    "Cars around these parts get mighty dirty with all the road salt, and washing a car outside with water is out of the question for me when its really cold.",
    "I was looking for an alternative to a traditional car wash since I have no water source at my apartment, and ended up purchasing this product because of the awesome reviews.",
    "I had a  very unwell bird attack my hood the other day, after rinsing off what I could with seltzer water I did the whole hood with this car wash and these MF towels.  ",
    "I could see the Griot's Spray-on Car wash excelling in this department, but it would be far less expensive and just as effective to use a mix of water and car wash\/wax detergent.",
    "I use this on my Porsche every few days and rarely need to wash my car with water.",
    "This waterless cleaner works well, but it's best for touch-ups rather than as a replacement for washing with water.",
    "Easier than washing, and no water wasted.",
    "Our parking at the airport was indoors to protect my car (2006 E350) but water from the higher levels somehow seeped down and got dirty water all over my car.",
    "Nice clean car; no water.",
    "It is great for an in between car wash with water not a replacement.",
    "And in the winter time when they cut off the water to the car wash stall, I've simply gone without a car wash up to now.",
    "Works fine but I wonder just a bottle of water with a lint free cloth would have worked fine too.",
    "If your vehicle is very dirty, this product does not replace the car wash but is great for quick touch ups to keep your vehicle show-room clean.  ",
    "If like me you've been skipping car washes entirely in the winter months, this product can take a full car wash's place.",
    "Now I can do my own car washes...in the winter...with no water.",
    "This is my go-to product in the Winter where using a hose\/water isn't always an option.",
    "The only time I'll use this produce is when I'm looking to clean minor dirt and water spots that form after rain.",
    "Man our vehicles can get quite dirty during winter when we might live in towns that use dirt to cover up snow.",
    "In the winter months, it's hard to keep the car dirt free.",
    "Great for when washing facilities are not available, quick touch ups, or in the winter like I did.  ",
    "It is below freezing in the winter here in Michigan, and I just cleaned the outside of my car with the Griot's solution and wiped it off.",
    "I used this kit over the winter when I couldn't get the car outside to wash it properly.  ",
    "Great during the winter, I can wash my car in the garage.",
    "This is convenient in the northern winter when bucket washing in the driveway is not possible.  ",
    "This is an ideal kit for use in chilly weather, for 'touch ups,' or for water conservation.",
    "This winter we had a few warm days and I wanted to clean off some of the road grime that built up.  ",
    "I'm not a \"wash my car every weekend\" sort of person, but since I got a new dark colored car, dirt shows up more easily",
    "The key is to let the product sit for about 30-seconds to loosen up the grime\/film\/dirt.",
    "I recently bought a station wagon that, as most do, collects dirt on the tailgate almost instantly.",
    "That's because it takes a lot of the fluid to get dirt off and there are not enough cleaning cloths, which are also pretty small.",
    "Took me about 20-30 minutes to clean my entire car!My only issue is that the sprayer attachment wasn't working.",
    "It took me about 30-40 minutes (because my car was so dirty) to spray down, let the solution set, and wipe the car clean.",
    "Bird droppings and other misc spots I spray on, let it sit a few seconds and then the mess just wipes off with no heavy rubbing at all.",
    "With this spray-on car wash I can allow more time between trips to the regular car wash, and it's a lot less mess and hassle than using a bucket and hose.",
    "Just for review purposes, I did clean the back of my black SUV and it cleaned and shined it to a beautiful finish, and I bet it would be great for in between professional cleanings, but I live it for my Harley.",
    "My only caution is if your vehicle is really dirty go to the car wash first and use this as maintenance in between soap and water washes.",
    "I think I will use it for touchups between washes at the car wash, including that spot under the rear spoiler on my Prius that never gets fully clean.",
    "I go along with the other reviewer here that suggests if your car is really a mess, go to a car wash first and then use this going forward as an in between).",
    "I use this on a black car between major detailing.",
    "The product works very well for cleaning dirt and grease of of my vechicles between washes.",
    "This is the perfect stuff to keep your car looking great in between big washes.",
    "It IS an excellent car finish cleaner though, and if you regularly get a car wash you can certainly use it in between to spot clean areas and keep your car looking freshly washed.",
    "The microfiber cloths are a bonus.. but I am forever using this stuff on my Porsche between washes.",
    "Now I can spot clean and touch up between washes easily because this kit really does work.  ",
    "I live in Sacramento and it gets hot here, so the formula, if left on for too long, will leave stains on your car.  ",
    "Despite how soft the provided cloths are and how great this spray is, I can't recommend using this to wash an entire vehicle with built up dirt or dust.",
    "My car was really dirty when I tried this product.",
    "It can probably be done with only the three included towels, but I wait until my car is pretty soiled to use it and the towels get really dirty fast.",
    "All the incredible  mud grime & dirt after an Alaskan winter do build up on the cars & it can really look bad.",
    "My 1st use: My car was dirty from driving in the rain and wet roads for a week.",
    "Even if your car gets dirty a lot - this 32 oz. size will last you awhile.",
    "These towels get fibers all over the car so spend your savings on the AB clothes.",
    "I used it on my '12 XKR and it was dirty, not just dusty.  ",
    "I had to use several other towels to clean the whole car.",
    "I found that I needed to use a lot more than 3 towels to cover the car and avoid smearing grit over the clearcoat.",
    "I followed the instructions on the box and sprayed on the Car Wash, let it sit and gently wiped it off with the included towels.  ",
    "be warned if the clear coat on your car is not in good shape then this product may not give you good results.",
    "Griot's Garage Spray-On Car Wash Kit contains a spray bottle of cleaner, and three super soft microfiber cloths.",
    "I find micro fiber towels an important part of getting great streak free results.  ",
    "I fold the towel so it is about a 6x6 square and also turn the towels often for best results, especially the buffing towel.",
    "Had the chance to clean my car completely today - had some light dirt, dust, and a couple of bird droppings on it (last washed two weeks ago, has rained since).",
    "By then, my car was awash in that white rain film, as well as some brown dust and grey dirt.",
    "I started iwth a car that was very dirty from road salt and in less than 10 minuets I had a car that looked like it came out of the car wash.  ",
    "When I got home, I found areas of the car that were still dirty.",
    "The fenders and doors still had dirt on them.",
    "So I rode my bike the other day in the rain and it was real dirty so I used this spray on was",
    "I have a black Harley Davidson that was recently ridden in the rain.  ",
    "On a cool, dry, sunny day, after days of rain, I decided to try this kit, which consists of a cleaner and 3 microfiber towels."
  ],
  "14866":[
    "I had a 60 dollar one-piece from wal-mart before this that was superior in most ways, but I needed something legitimately waterproof and a bit warmer (I had to wear a leather jacket on the coverall below 40 F).  ",
    "i rode all last week in the rain with this suit and boots and did not get one drop of water on my clothes underneath.",
    "I wear it for snowmobiling and it is warm,waterproof,and the various pockets are functional.",
    "NO water issues, and, had I had on some thermals, I'm sure there wouldn't even have been that slight chill.",
    "This suit has kept me warm during all of those conditions, and it sheds water really well.",
    "The suit is definitely waterproof as I found out while plowing snow in a wet snow blizzard.",
    "I purchased the Firstgear Thermo One-Piece Suit in November of 2012 and had only worn it a couple of times in relatively mild 40F temps and was satisfied with it then.",
    "The next few days were still in the mid 20's and I was able to wear just the suit and I never got cold.",
    "I would recommend this suit without any reservations - I tend to get cold when riding and this suit has solved that problem perfectly.",
    "Although I wasn't outside long, I could tell that this suit would have kept me warm in the low 40's I was hoping to ride in.",
    "This suit was bought for spring motorcycle rides to and from work in northwest Pennsylvania , 100 miles round trip in 30 to  50 degree temps.",
    "This single piece of clothing is the best investment I made for keeping comfortable this winter.",
    "Most times I am just appropriately warm for the level of physical activity; in fact, I don't even think about the outside temperature or my comfort while riding any more.",
    "Out of necessity, car in the shop, I've had to ride my bike in very fridgid temperatures to work this week.",
    "It is just the ticket on 30 degree highway rides to work on my bagger, and is very comfortable at 35F and above on my naked bike.",
    "I've been wearing it to work on sub 30 degree days and it keeps me toasty warm.  ",
    "I am about to use it on Cell Tower work in this winter cold so... that shows how much I recommend.",
    "I wear this for my 40-mile motorcycle ride all winter (except when it's wet), and it's astonishingly warm - even when it's 30 degrees or less outside!",
    "When I got downstate temps were in 70ish and I was not hot at traffic stops, but am sure I would have been if I had stopped longer than a few minutes.",
    "Went Snowmobiling this past February and it was at or below zero the entire day while we were riding and the Suit WORKED GREAT!!!",
    "Suit is very warm, even down to the 20s.  ",
    "Overall it is a great suit to keep you warm in the cold both in morning and at night.",
    "I highly recommend this suit to anyone that needs to ride in temps below freezing.",
    "I have never been cold even once while wearing this suit, and we ride 80-90MPH at times  ( I know, not as fast as you lake racers!)  ",
    "I found this suit is best when the temp drop below 50 degress.  ",
    "I do Exterior inspections of homes for an insurance company in Maine so winters here are brutal this suit did the job in keeping me warm and dry.",
    "I bought this suit so I could ride in weather between 35 and 55 degrees.  ",
    "In both situations, this suit has kept me warm and dry, even in wet weather.",
    "The only bad thing I can say about this suit is that once the temps reach 65ish, you're ready to take the thing off.",
    "THIS SUIT IS AWESOME.I'd say the coldest temps I've had to ride in with this suit range between 25-28ish.",
    "If you are looking for a winter suit, one of this quality will easly cost you 500 bones.  ",
    "I had been wanting to get a 1-piece suit for a while now, but had been unimpressed with what I say for what I was going to have to pay.  ",
    "Anyone looking for a comparatively inexpensive winter riding suit that is good quality, and gets the job done?",
    "Overall, I think the suit is fantastic based on the price point.  ",
    "It is exactly what I had hoped it would be and the price was the best and the delivery swift.",
    "When all is said and done, if you want to get a real bang for your buck you cannot go wrong with this suit.",
    "This full body suit is worth every penny.",
    "For the price this suit is WELL WORTH THE MONEY!!!",
    "For the money, this suit is amazing.  ",
    "Excellent suit for price.",
    "This morning when I left the house at 5am it was 27F and I was definitely NOT looking forward to the 30 mile ride to work.",
    "The only issue I have is that it's usually pretty warm by the time I ride home after work (maybe 75 degrees by then) and the suit is way too hot to wear then....of course, that has nothing to do with the quality and build of the suit.  ",
    "I'm confident it would provide great warmth too.  ",
    "I wouldn't wear it above 60 deg temps because it would just get too warm.",
    "I would highly recommend this suit for anyone interested in riding in the cold.",
    "Rode to work during the &#34;Polar Vortex&#34; and stayed as warm as if it was springtime!  ",
    "I'm a person who feels cold more than the average person.  ",
    "i ride in this 35 miles one way in 27 degree weather here in houston",
    "I would have liked some armpit zippers for ventilation, because this suite is really warm.",
    "I'm planning to ride my Can Am over the winter months so I decided to buy several items to keep me warm.  ",
    "Really think that it should have that and maybe since we are in Arizona, where it's cold up north, but, riding back down to the valley it's hot as heck that there can be some vents built in that can be opened.",
    "The suit is well made, designed to keep the wind out and keep you warm.  ",
    "I was warm and toasty and only had regular stree clothes under the suit.",
    "I have worn this suit while riding my motorcycle in 40 degree weather and while plowing snow on my quad in 10-20 degree weather.",
    "I have ridden in everything from 20 degrees up to 55 with this suit on and have not had any problems.",
    "Great suit for Cold Temps.",
    "After reseaching for many months and not being able to ride due to cold weather, I decided to give this suit a try.",
    "When I got home, I told my wife that I was nice and toasty and was amazed out how warm the suit kept me.  ",
    "I bought this suit back in February so I could deal with the frigid temps on my bike.",
    "By the time I made the 20 mile trip to work I was sweating.",
    "My average speed was 50mph with a top speed of 75mph for an hour drive each way (42 miles one way).FirstGear kept me very warm and toasty and am extremely pleased.",
    "This suit is so warm when riding.",
    "The stich work is great and the zippers give no problems at all and the suit keeps you warm and dry .",
    "After a few trips now I have learned that what ever clothing I wore to work that day is sufficient to keep me warm while wearing this suit; no more layering required!  ",
    "I wear a heat vest under this, followed by my armored coat, followed by this suit.  ",
    "In all cases, it burns easier than any given pair of ordinary clothing would.  ",
    "I was very dissapointed that this had happened as I had assumed that as riding gear this would be part of the requirements that the part that will be possibly in contact with the exhaust pipes should be able to withstand the heat from them.",
    "I have V&H; Softail Duals on my bike and the left exhaust rides up high next to my inner calf and the heat shield on legs of this suit have held up nicely...so far no burns or melting.",
    "Suit is defintely warm.  "
  ],
  "3013":[
    "But then I put all 3 kids in for a walk ...(3,2,11 months)...it is pretty heavy with all 3 kids and you will definitely need some muscle to push it with 3 toddlers....I'm sure I'll get use to it...",
    "REVIEWPros:-accommodates 2 infants in their bucket seats and a toddler-lightweight for its size-versatile-not too expensiveCons:-very hard to steer on uneven surfaces such as a sidewalk-really long and hard to maneuver in stores-back seat is too small and makes kid lean to use-have to take infant seat adapter off every time I load it into my minivan which is a bit difficult-bottom basket is hard to access with everyone loaded-no cup holder or parent organizer-tires are too small and don't handle sidewalk cracks very well-no suspension and a \"hard\" ride-kind of cheap looking-front seats don't recline quite enough-not at all usable on a mulched trail or grass unless you're ready for a work out!My SolutionAs you can see, my cons list is very long so I ended up trading up to aValco Baby Tri Mode EX Twin Strollerwith",
    "Great stroller, yes it is big and you may have a tough time putting it in your car but what would you expect it's a stroller meant for 3 kids.",
    "I was a little leery at first since I had a Jeep double stroller before I purchased this, and it was so difficult to maneuver.",
    "The bottom basket is large as well, except that it can be difficult to get things in and out of the basket due to all the obstructions.",
    "dont buy...i call this stroller the \"beast\" hard to turn.  ",
    "With my son sitting\/standing on the little seat provided for him along with the twins in their car seats this stroller is VERY heavy and does not maneuver well at ALL.Again, think of a heavy shopping cart.",
    "Plan on carrying it yourself, because this stroller is going to be more of a pain to try to squeeze it in.",
    "It is so hard to steer my wife who is petite can't use the stroller.  ",
    "Very hard to maneuver the stroller itself.",
    "The positives are that this stroller is pretty sturdy, and actually isn't too difficult to push around.",
    "but it was soooo heavy I had a hard time getting it in and out of the mini van.  ",
    "Now that the girls weigh 25 pounds each and my son is about 29 pounds, I can hardly push the thing.  ",
    "My twins fit well in the seats, but as I read and ignored, it's really hard to steer.",
    "I wish the wheels were a bit larger because it is difficult to maneuver.  ",
    "I see a lot of reviews that it is too heavy and too hard to maneuver, but I think it is great.  ",
    "I also find collapsing it to be more of a struggle than with other strollers.",
    "Also it is hard to push as I think the handles are awkward.",
    "I think anything with three kids in it is going to be hard to steer unless it's a car!  ",
    "It takes some work to push up a hill and I do have to go backwards to get up the step to my front door but that is no big deal to me.  ",
    "it is pretty heavy and hard to steer, I have to admit...",
    "I saw some negative reviews saying that it was hard to steer and flimsy.  ",
    "Often I can't get it back in the trunk  on my own and I have to put down one of my seats to get it to fit.",
    "Looks amazing the twins who are 1 and the 2 year old I have all love this stroller.",
    "My friend who also has 3 kids (11 mo twins and a 2 yr old) loves this stroller though.  ",
    "My 2 and 3 year olds both love the sit and stand platform and my 7 month old loves the second seat which is higher than the front seat - allowing her to see the world...",
    "For the most part, I like the stroller, and my kids like the stroller, with just a bit of tweaking, it could be perfect.",
    "This was a perfect fit for my 4 year old and 2 year old.",
    "The stand on addition is great for my 3 yo daughter.",
    "They are very excited to have this stroller",
    "The quality is excellent,I receive compliments everywhere I go and the kids love it.",
    "I was extremely impressed with its maneuverability, and how much my two toddlers loved it.",
    "I LOVED the snap & go for my girls!",
    "At corners, you have to lift up the entire back end of the stroller (which requires the child in the back to get out) and turn while only on the front wheels.",
    "I have 2 kiddos and a 3rd due any day.",
    "I bought this stroller to get around with my 3 children (3-1\/2, 2, and 7 months) and I think it is great; especially for the price compared to other triple strollers.  ",
    "I was uncertain based on mixed reviews, but with newborn twins and a 2 1\/2 year old I was desperate to get anything to fit the 3 of them so that I could make it out of the house with all three of them.  ",
    "but I have yet to find another stroller that accommodates the needs of 3 kiddos 1 being a toddler :)",
    "I purchased this stroller for my twin girls and 2 1\/2 year old son.  ",
    "I put the newborn in the front, the 1 year old in the middle and my 2 year old sat on the bench and it worked great.  ",
    "I got this for my 2 1\/2 year old, 1 year old, and newborn.",
    "For that additional money, I can finally take my 3 month old twins and my 2 year old toddler on walks to the store and park WITHOUT killing my arms.",
    "I have an almost 4 year old, an almost 2 year old and a newborn and they ALL fit in this stroller perfectly.  ",
    "I have a baby due in October when my oldest will turn three and my middle child will be 20 months, so I really needed something that could contain two young toddlers and keep a baby carrier.",
    "We have a 2 year old, a 1 year old and a newborn.  ",
    "We got this for our new born, 1 year old and 2 year old.",
    "Not one of my three kids (2, 3 and 4) could tolerate the jumper seat.",
    "It comfortably seats my 3, 2 and newborn!It navigates easily enough through store aisles, parks, zoos, etc.",
    "I'm a mother of 3 boys 3, 2 and 2months and so far love this product.  ",
    "This was for my 3,2 and an infant.  ",
    "I bought this for my newborn twins and 1.5 year old.  ",
    "I have a 22 month old son and 2 six week old twins.  ",
    "This stroller seats my 3 under 3 comfortably, it is light and easy to push.  ",
    "It is, after all, a stroller designed for 3 children, so it is going to be heavy.  ",
    "For having 3 children under 3, we definitely needed this stroller.",
    "The licensing agency who holds my foster license purchased this for me as I have 3 babies, 32 months and younger.  ",
    "I'm really excited to take it shopping, as I can now fit all 3 kids in it",
    "I have a 3 year old son and 14 month twin girls.  ",
    "I have 3 children.",
    "so I really needed something for 3 kids.",
    "With the baby in the front in carseat, I can put the 2 year old in back and have either the 4 or 5 sit.",
    "but, I do have 3 children under four to push and this is definitely the lightest, easiest option I have found.",
    "I have a 5, 4, 2 and newborn.",
    "I have a 3yr old, a 21 month old and a 2 month old",
    "I have 3 young children and this is what it's made for.",
    "And the best thing is that it pushes and turns SO EASY with all three of my kids in it.  ",
    "So I strapped one of the babies to me in a carrier,left one of the babies in their car seat on the stroller and put my toddler in the front seat.",
    "I have never written an online review of a product, but this stroller is a lifesaver for a mom\/caregiver with three or more kids",
    "Having three children under the age of 5, I finally decided to get a triple stroller.  ",
    "My kids are 5,4, and 1 and this meets our needs perfectly.",
    "But;(1)not a great deal of room for my two year old with the infant seats on.",
    "if you have just 2 kids the back is perfect for bags (whether shoppng or traveling) and there is alot of room under the front 2 seats.",
    "i have an 18 month old and a 2 month old.",
    "My only mobile child is 2 years old.  ",
    "I'm a mother of twins (10 months) and toddler (2 years).",
    "We have a 3 girls two around 35lbs and and infant.  ",
    "We have 4 month old twins and an older child so this was perfect for all 3.",
    "We are having twins and have a 3 year old boy already.  ",
    "The straps one this are a MUST or your kids WILL fall out - ask my 3 year old.",
    "On the upside it does accommodate all 3 kids and seems to be sturdy (minus the back foot rest falls off a lot but just snaps back in).",
    "It has met my needs for all 3 of my children.  ",
    "* Read before purchasing-its pretty longI am a mother of a 33 lb almost 3 year old boy(this comes into account later) along with 4 month old twins.",
    "It is the only option out there for a mother of 3 under 17 months old.",
    "We purchased this stroller because we have two toddlers and an infant.  ",
    "This stroller is just the ticket to carrying all three small children.  ",
    "Otherwise this is a fantastic stroller that accomadates our large family of 5 boys.",
    "I'm guessing anyone who needs a stroller this size has plenty of cargo for three little ones.  ",
    "I would recommend this, but be willing to carry an infant in a sling or for a toddler to stand a lot for the first few months (if you have twins).",
    "I love that it comes with the carseat adapters, perfect for our growing family.  ",
    "I haven't found anything out their better for the double infants + toddler combo!",
    "I have three girls each 24 months apart so my oldest just turned four when the baby was born.",
    "I have no problem pushing it loaded with all three kids.",
    "I have infant twins and a two year old.",
    "I have a three year old (who is only 28 lbs) and 4 month old twins.",
    "I give it 4 stars only because it doesn't really fit in my van but my kids",
    "and I push the two babies in the sit and stand double that I have as well.",
    "I have owned my fair share of strollers and while this has some downsides, I think it is the best for the money.",
    "Overall, I think this is a great stroller for the price.",
    "This stroller was ok for the price compared to other double strollers.",
    "I thought for the price they should have included the organizer.  ",
    "Put the least amount of weight in the front.4)With 3 kids in the stroller, you will undoubtedly have to answer the question, \"Are they all YOURS?\"",
    "(I have tried the tri mode that accommodates 3 but it is just to wide and heavy also).",
    "Prior to owning this stroller I owned a grace duo glider, and this stroller feels lighter, and a bit easier to push.",
    "The stroller itself is relatively lightweight.",
    "It is actually lighter in weight than that particular stroller.",
    "The weight is reasonable for the size and overall the stroller looks very attractive but not practical.",
    "I am a slender woman and I can lift it easily.",
    "What else would you expect from something that seats 3?2)The front tray or car seat attachment has to be removed for the stroller to fit in my Town & Country.3)It's not the easiest to steer.",
    "My only complaint would be that it is soo big that I almost couldn't fit it in my minivan with the third seat lowered.",
    "I have a Nissan Armada (which is like driving a bus) and I have to put down one of the third row seats to get it to fit.)  ",
    "My only complaint is that it doesn't fit in my mid size suv without putting a third row seat down so use the measurements provided if this is a concern.",
    "First of all, the stroller is very long and it does not fit in the back of my Yukon XL, I had to removed the front seat tray in order to fit it in my truck and even then I have to angle it so that it will fit.",
    "I have a dodge grande caravan, and I have to angle the stroller funny to get it to fit back in the trunk.",
    "My husband and I have a Hyundai Elantra and a Dodge Durango, the stroller does not fit in the trunk of the Elantra or the Durango, if the back seat in the Durango is up.",
    "It is a LARGE stroller so you do need to make sure it will fit in the back of your vehicle.  ",
    "If you own a Tahoe or Suburban the stroller will fit in the back.",
    "Having a double\/triple stroller is great but it is big barely fits in the back of my Mini-Van.",
    "I then tried to fit it in my Odyssey and with the 3rd row up, this was the only thing that could fit in the trunk.  ",
    "I have a Honda Pilot and it just fits in the trunk behind the back seat.",
    "I have a Chrysler Town and Country minivan and it barely fits in the back after I take off the attachments which is the only reason I didn't give it 5 stars.  ",
    "And finally, it wouldn't fit in the rear storage area of my 2011 Town and Country, which means I had to put one of the rear seats and one of the second row seats down.",
    "I just wanted to let everyone know that this does not fit in the the back of a 2012 honda odyssey.",
    "I love how simple to fold it is, the only problem I found with this was the fact that it's really, really long so it didn't fit in the trunk of our car.",
    "it really is a great stroller, just big.",
    "It's an OK stroller....",
    "It's a good stroller otherwise.",
    "Excellent  stroller."
  ],
  "464":[
    "I was uncertain based on mixed reviews, but with newborn twins and a 2 1\/2 year old I was desperate to get anything to fit the 3 of them so that I could make it out of the house with all three of them.  ",
    "I have an almost 4 year old, an almost 2 year old and a newborn and they ALL fit in this stroller perfectly.  ",
    "I put the newborn in the front, the 1 year old in the middle and my 2 year old sat on the bench and it worked great.  ",
    "we have twin girls and a little boy who are 18 months apart.",
    "It comfortably seats my 3, 2 and newborn!It navigates easily enough through store aisles, parks, zoos, etc.",
    "With the baby in the front in carseat, I can put the 2 year old in back and have either the 4 or 5 sit.",
    "I have three girls each 24 months apart so my oldest just turned four when the baby was born.",
    "I have a baby due in October when my oldest will turn three and my middle child will be 20 months, so I really needed something that could contain two young toddlers and keep a baby carrier.",
    "Also 2 baby carriers fit in perfectly!  ",
    "So when our third third child  was ready to be wheeled around I thought this Joovy would fit our growing family.",
    "I'm really excited to take it shopping, as I can now fit all 3 kids in it",
    "This stroller is just the ticket to carrying all three small children.  ",
    "Otherwise this is a fantastic stroller that accomadates our large family of 5 boys.",
    "the stroller actually could be smaller, it's nearly impossible for the kids to touch each other because the seats are so far apart (which is a plus), but the added length make this stroller nearly impossible to put away.  ",
    "With infant seats it is next to impossible for the 2 year old to sit on the jump seat and the seats only partially recline, so a infant must be serveral months to use without carriers.  ",
    "Great stroller, yes it is big and you may have a tough time putting it in your car but what would you expect it's a stroller meant for 3 kids.",
    "dont buy...i call this stroller the \"beast\" hard to turn.  ",
    "But then I put all 3 kids in for a walk ...(3,2,11 months)...it is pretty heavy with all 3 kids and you will definitely need some muscle to push it with 3 toddlers....I'm sure I'll get use to it...",
    "(I have tried the tri mode that accommodates 3 but it is just to wide and heavy also).",
    "Third problem would be that to fit the stroller in the car, you have to detach all the trays, or car seat holders, and the umbrellas, and they don't detach very easily, which can turn into a big problem",
    "I also find collapsing it to be more of a struggle than with other strollers.",
    "Also, the basket below was very hard to access except from between the two seats, which is really only convenient if there is no kid in the rear seat when you need to get in there, otherwise their feet are in the way.",
    "Also it is hard to push as I think the handles are awkward.",
    "My only complaint would be that it is soo big that I almost couldn't fit it in my minivan with the third seat lowered.",
    "My only \"complaints\" would be that it is super hard to push with even the slightest incline.",
    "It takes some work to push up a hill and I do have to go backwards to get up the step to my front door but that is no big deal to me.  ",
    "Also, the trays are a little difficult to snap off, but maybe this will get easier with wear.",
    "With my son sitting\/standing on the little seat provided for him along with the twins in their car seats this stroller is VERY heavy and does not maneuver well at ALL.Again, think of a heavy shopping cart.",
    "Plan on carrying it yourself, because this stroller is going to be more of a pain to try to squeeze it in.",
    "It is so hard to steer my wife who is petite can't use the stroller.  ",
    "I was a little leery at first since I had a Jeep double stroller before I purchased this, and it was so difficult to maneuver.",
    "First of all, the stroller is very long and it does not fit in the back of my Yukon XL, I had to removed the front seat tray in order to fit it in my truck and even then I have to angle it so that it will fit.",
    "I have a dodge grande caravan, and I have to angle the stroller funny to get it to fit back in the trunk.",
    "Very hard to maneuver the stroller itself.",
    "They also have an 18 month old.  ",
    "* Read before purchasing-its pretty longI am a mother of a 33 lb almost 3 year old boy(this comes into account later) along with 4 month old twins.",
    "i have an 18 month old and a 2 month old.",
    "My friend who also has 3 kids (11 mo twins and a 2 yr old) loves this stroller though.  ",
    "We have a 2 year old, a 1 year old and a newborn.  ",
    "I got this for my 2 1\/2 year old, 1 year old, and newborn.",
    "We have 4 month old twins and an older child so this was perfect for all 3.",
    "It is the only option out there for a mother of 3 under 17 months old.",
    "As a mom to three babes under the age of three (33 months, 18 months and 11 months), this is definitely a life saver!  ",
    "The licensing agency who holds my foster license purchased this for me as I have 3 babies, 32 months and younger.  ",
    "This was a perfect fit for my 4 year old and 2 year old.",
    "I have infant twins and a two year old.",
    "I have a 3yr old, a 21 month old and a 2 month old",
    "but I have yet to find another stroller that accommodates the needs of 3 kiddos 1 being a toddler :)",
    "For having 3 children under 3, we definitely needed this stroller.",
    "Large enough for the twins and also the toddler.",
    "Would definitely recommend to friends with small children.",
    "On the upside it does accommodate all 3 kids and seems to be sturdy (minus the back foot rest falls off a lot but just snaps back in).",
    "It has met my needs for all 3 of my children.  ",
    "I have 3 children.",
    "I have a 5, 4, 2 and newborn.",
    "so I really needed something for 3 kids.",
    "but, I do have 3 children under four to push and this is definitely the lightest, easiest option I have found.",
    "This was for my 3,2 and an infant.  ",
    "I have 3 young children and this is what it's made for.",
    "We purchased this stroller because we have two toddlers and an infant.  ",
    "It's the best option if you need a narrow stroller, and beggars can't be choosers (so few options for three kids!!).",
    "I'm guessing anyone who needs a stroller this size has plenty of cargo for three little ones.  ",
    "I have never written an online review of a product, but this stroller is a lifesaver for a mom\/caregiver with three or more kids",
    "Having three children under the age of 5, I finally decided to get a triple stroller.  ",
    "I bought this for my newborn twins and 1.5 year old.  ",
    "I have a three year old (who is only 28 lbs) and 4 month old twins.",
    "My three year old stands (or sits) and the two babies (9 months and 22 months) ride in the seats.",
    "I have a 22 month old son and 2 six week old twins.  ",
    "I would recommend this, but be willing to carry an infant in a sling or for a toddler to stand a lot for the first few months (if you have twins).",
    "We got this for our new born, 1 year old and 2 year old.",
    "Plus, I can lay my infant down flat and my one year old is still strapped in.  ",
    "I'm a mother of twins (10 months) and toddler (2 years).",
    "We have a 3 girls two around 35lbs and and infant.  ",
    "and I had a newborn.  ",
    "Without using infant carriers, this stroller is not conducive to newborns or small infants.  ",
    "I like how this stroller offers the food tray as well as a universal piece for all infant seats to attach.  ",
    "I was excited to purchase this for my 3 youngest (ages- 5,3,1 ) the stroller is definitely large to store but what would you expect.",
    "But;(1)not a great deal of room for my two year old with the infant seats on.",
    "There also seems to be a lot of storage on the bottom!!",
    "The only factor we didn't account for was the length of the stroller when folded up.",
    "It is a LARGE stroller so you do need to make sure it will fit in the back of your vehicle.  ",
    "Having a double\/triple stroller is great but it is big barely fits in the back of my Mini-Van.",
    "Great stroller, solid, well build, but be warned it is huge and requires a lot of room for storage and transportation.",
    "3rd child has room like an average sitnstand stroller.",
    "My husband and I have a Hyundai Elantra and a Dodge Durango, the stroller does not fit in the trunk of the Elantra or the Durango, if the back seat in the Durango is up.",
    "I have a 3 year old son and 14 month twin girls.  ",
    "For that additional money, I can finally take my 3 month old twins and my 2 year old toddler on walks to the store and park WITHOUT killing my arms.",
    "My 2 and 3 year olds both love the sit and stand platform and my 7 month old loves the second seat which is higher than the front seat - allowing her to see the world...",
    "We are having twins and have a 3 year old boy already.  ",
    "The straps one this are a MUST or your kids WILL fall out - ask my 3 year old.",
    "I bought this stroller for my 2 1\/2 year old and NB twins.  ",
    "Looks amazing the twins who are 1 and the 2 year old I have all love this stroller.",
    "I purchased this stroller for my twin girls and 2 1\/2 year old son.  ",
    "We have three kids: a set of 7-month old twins and a 29-month-old toddler.",
    "The stand on addition is great for my 3 yo daughter.",
    "I'm a mother of 3 boys 3, 2 and 2months and so far love this product.  "
  ],
  "1398":[
    "The 48 Hour Sustainable volume spray works great.",
    "It gives my hair a nice shine and boosts the volume so it looks as if my hair is thicker than it actually is and the body does last the 48 hours, second day is better than the first!",
    "I have fine straight hair & this volume spray helps more than almost any other produce I have used to give extra body & lift.",
    "It dies down a little throughout the day but I still have considerably more volume than I would if I blow dry hair upside down without this product.",
    "I have lots of fine, blonde hair that I am always searching for the ultimate product to give me volume, movement, and hold all in one.  ",
    "I finally found a product that adds volume to my extremely fine hair without stiffness or stickiness.  ",
    "I have kind of fine hair.this product works wonders in giving it volume.",
    "would recommend this product to  anyone who needs volume",
    "Using these products with the spray gives my hair volume I never thought I'd see.",
    "I spray this in my roots when my hair is still wet the use the blow dryer to get some extra volume.",
    "I spray it at the roots, rub it in with fingertips and blow dry my hair upside down and am given ample amounts of volume!",
    "Really does make my hair look like it has more volume, and the day after looks even better.",
    "It sprays on nice and light and adds a distinct amount of volume to my fine, processed hair.  ",
    "It gives fine hair a lot more body and volume.",
    "It gives boost and volume to my limp, fine and straight hair!  ",
    "I have very fine, straight, shoulder length hair and have tried so many expensive and inexpensive products to give my hair volume and bounce.  ",
    "I have thin, fine hair and this gives such a great amount of volume ...never makes my hair feel like straw.",
    "Great product; adds volume without making hair sticky.  ",
    "This product used in combination with the shampoo and conditioner really plumps up fine limp hair.  ",
    "This is the first product I've used that helps my fine hair hold curl without it feeling heavy and getting oily quickly.",
    "I have fine thin hair and always use some sort of product to give my hair texture and body.  ",
    "This did not give me volume for 48 hours.  ",
    "This volume spray is just great!  ",
    "It does keep the style as advertised  If possible, I will not be without this volume spray.  ",
    "my hair was horribly thin - this product has really helped alot to add volume.  ",
    "thought bamboo would make my hair thicker, but really could not tell the difference,  I use Nioxin products and can tell the difference in thickness of my hair.",
    "this product gives lots of volume without the weight.",
    "Great product - delivers volume without tacky or &#34;too-much product&#34; feeling and I really like the scent love Alterna products in general!!",
    "All I expected from this product was the volume.  ",
    "This is one of the best hair products I have ever used for volume and just great feeling hair.",
    "This is my second day, and my hair still has some volume.",
    "This gives volume but feels like I need to use so many sprays even on my short hair which will deplete the 4 ounces too fast.",
    "My hair has volume all day.  ",
    "It leaves my hair shiny and full of volume.",
    "I love the way my hair looks and feels it gives volume to your hair without adding weight.",
    "I like the volume it is adding to my hair AND the strength it is giving to my nails.",
    "I have very thin hair and can't expect miracles, but I did not see much change in the texture and volume.",
    "Gives my hair lots of volume.",
    "The promise was thicker more textured hair for those of us with baby fine strands.",
    "I have very fine, frizzy hair and this 48H volumizer makes my hair look much fuller and bouncier.  ",
    "I noticed a little difference in my hair texture, but it didn't keep any lasting volume as described in advertising.",
    "With this product, I have thick full hair that holds up beautifully the next day.  ",
    "I love this product; my hair looks thicker and I am finding that I can style the way that I want it to.",
    "Alterna gives my hair texture and thickness I have not found in any other product.",
    "oh yeah another product that is going to make my hair actually look thicker - well I used it this morning and guess what it actually does !",
    "sustainable volume.",
    "works as advertised - after using it several times a week (after each shampooing), it convinced me that my hair was now naturally thick, so I stopped using it, and found out I was in denial.",
    "My hair is still left silky smooth but with a thicker look to it.",
    "It made my thin hair feel and look much thicker and fuller and did not weight my hair down.",
    "I use it afer every shampoo and it has given my thin hair a body boost.",
    "I love that I can go 2 days with the feeling of thicker hair.",
    "Definitely plumps the hair up without drying.  ",
    "It helped my hair retain it's smooth silky feeling without the frustrating flatness that sometimes comes with it.",
    "My hair definitely is fuller etc.",
    "Not only does my hair look fuller, but I don't have to work even half as hard with a round brush and hairdryer.",
    "and this does a terrific job of making my hair appear thicker and hold a style and it smells wonderful !",
    "Although I have a fair amount of hair, the silkiness often made it look flat, no matter what levl of blow-out was done to it.",
    "My hair is much fuller and appears to be more healthy -- while not being to heavy.",
    "I have very fine, straight hair and usually have to wash and style it every day because it won't hold a style for more than 24 hours.",
    "This actually does give you 48 hrs.",
    "I honestly don't know if it lasts 48 hours.",
    "And it really does last 48 hrs!  ",
    "And it does last for 48 hours with a quick touch up",
    "I have used so many things as my hair is thinning and fine ( great combination !)",
    "It helped me through a period of thinning hair after weight loss and hormonal changes, and now with my hair healthier, I don't have to use it as often.",
    "this product is too heavy for those of us with thin or fine hair.  ",
    "For someone with finer, shorter hair, I can see this being an excellent product.",
    "Highly recommended for thin hair.",
    "I don't know what I thought the results would be.  ",
    "Unfortunately, I haven't experienced the results that the Alterna volumizer product had promised.",
    "I have very fine hair really didn't work for me, better products out there.",
    "Definitely not something I would buy again to use on my fine hair.",
    "My hair is very fine, this product didn't really make enough difference for the amount it cost.  ",
    "This product works better than any of the many I have tried.",
    "This stuff really works, tried other volume sprays, nope, they did not do the job."
  ],
  "16922":[
    "The first time, the color wasn't as noticeable because I made a few mistakes and left it in for too little time (also, I used ginger instead of paprika).",
    "I wanted to put some color in my hair without using harsh products.",
    "Next time I'll definitely try adding something to mask the smell.",
    "The red is a brilliant, lovely red that looks fantastic over my natural light brown, and I actually really like the smell.",
    "So I added a teaspoon of ginger, however I think chemically the henna mixture pulls pigments from whats added to it.",
    "Oh! - and I smell like gingerbread,now!",
    "Now the blond patches, in the directions there is a special effects portion that says that by adding a bit of ginger, paprika, or some other herbs I can't remember you can enhance the red tones.",
    "I used a mixture of camomile tea, cinnamon (for smell), and low fat plain yogurt.  ",
    "I like to smell spicy!",
    "I followed the directions for letting it sit for awhile to cure before putting it on my hair and I added chamomile tea for gold tones instead of plain water and some lemon juice.  ",
    "When I rinse the henna out, I do it in the kitchen sink because over time it can stain your shower's caulking orange, and if you are using a lot of henna you don't want to clog the drain.",
    "I think it's actually cut with sand, because I soaked the product with vinegar (acids help the dye release and stick to your hair better) and water with some olive oil.",
    "I will also use a deep moisturizer like coconut oil afterwards.",
    "I use Petroleum Jelly on my face, nape and ears to protect the skin near the hairline and keep it from absorbing the dye.",
    "I did put vaseline around my hairline and neck because this stuff does stain so use the gloves!  ",
    "The first time I mixed it up with the water, an egg, and some ginger and only let it \"cure\" for about 20 minutes.",
    "With the next application I mixed only with water and paprika and let it \"cure\" in the refrigerator all day, say 8 hours?",
    "I used a mixture of cold filtered water, lemon juice, and ginger, then let it cure for 24 hours before applying it.",
    "I mixed the powder with a bit of warm (not boiling) water and mostly lemon juice, then let it sit for 3 hours.",
    "I mixed the henna with distilled water that I had boiled in the microwave.",
    "I boiled my filtered water in a glass bowl in the microwave and slowly added it to the mix until I got the right consistency.  ",
    "I added apple cider vinegar, coffee( because I had old coffee, but no distilled water... and already have brown hair anyway...so)",
    "Could have been I didn't mix enough liquid into the mixture.",
    "I use about 2 T of corn syrup (so it doesn't flake- i don't measure carefully)and boiling tap water from my metal teapot.  ",
    "I followed the directions carefully and added distilled water as well as about 5oz of brewed chamomile and mint tea.",
    "Thanks to its creamy consistency it's a lot easier to apply, and I had no trouble rinsing it out although you do have to rinse for a while.",
    "I always line the floor and bathroom counter with cut open garbage bags so I can just throw away the mess when I'm done.5) Keep an old wet washcloth on hand for wiping up any drops that get on your face or arms6)",
    "I didn't like all the prep time to ensure my bathroom wasn't splattered with henna or the clean-up afterwards.  ",
    "The process is a lot messier than the chemical one, so be warned and have plenty of newspapers on the floor, a garment and towel separated out just for this and a pail or plastic tub to keep the first rinse from going down your drains.",
    "After I would use the Sunset Glo I would have to wash my hair at least twice and condition it",
    "Sooo, as the juice seemed to get soaked into the paste I just added a tiny bit of water here and there, making it easier to spread.",
    "i'm very efficient at henna application now, after so much practice, and i mix it a little bit thicker than the recommended yogurt consistency.  ",
    "I considered trying the clear for an inbetween assist but have seen warnings it may make the red take less evenly.",
    "I also added a spoonful of yogurt in my mix for extra conditioner.",
    "I have NO clue where the clumpy messy comments come from, my mixture was smooth and went on pretty easy.",
    "Buy plastic wrap and a couple of pairs of better gloves before using!",
    "i would definitely recommend using the gloves that come in the box.",
    "It is messy as hell, you'll want to drape the bathroom well and wear good gloves (don't bother with the silly ones that come in the box).  ",
    "Anyhow, I covered my hair withe the plastic cap but did not apply heat.",
    "So I washed my hair, put on the gloves and slathered on the \"mud\", it does have a grassy smell, but that was actually nice."
  ],
  "83":[
    "This case was only meant to protect the phone from scratches and scuffs or maybe from rough handling and small drops onto a table.",
    "If you have the same view of cases as I do (slim, clear, keep scratches away and give a little protection) than get this case!!!  ",
    "This case is primarily to showcase your phone as well as protect the aluminum sides\/finish of your phone from nicks and scratches.",
    "And of falls and scratches protects the material from which it is made.",
    "But I didn't get it for that, I just wanted something slim and clear (to show off this great phone) that would keep it free from scratches and give it just a little bit of protection.",
    "I thought that the screen would definately have cracked but thsnks yo iblason,my phone does not have a single scratch!This is the best ,yet inexpensive case for your HTC one....",
    "Very nice softgel flexible TPU case ultra clear feel comfortable on hand easy installation good materials and finished looks durable",
    "and I'd buy it again in a heartbeat BUT even though I wash my hands a LOT, the case is turning slightly gold\/brown from the oils in my hands.",
    "The first few months after you buy it's all good truly clear but after about 4 months the case gets a yellowish shade and it's not clear white anymore.",
    "Letting the case be exposed to sunlight for a long time will cause things like this to yellow.",
    "6 months later the crystal clear case is a grungy yellow...",
    "The case has yet to yellow, I've heard reviews about TPU material cases turning yellow, but then again I mainly pull my phone out indoors.",
    "Will buy again!Update: Still a very well molded good quality case, but like all TPU cases it starts to yellow after about 2 months."
  ],
  "22365":[
    "The speakers sound good on their own; however, I paired mine up with the Audioengine AS8 subwoofer to complete the system, which takes this setup to a whole new level.",
    "I added a subwoofer (not from Audioengine) and the sound with the entire setup is great.",
    "These speakers are small enough to fit comfortably on a desk and have great sounding bass without the added sub.  ",
    "They are the perfect size and the sound is wonderful; however, you I found that I needed a sub.",
    "I prefer deep rich sound, so I immediately bough the S8 sub to complement these A2+'s and all I can say is WOW-",
    "These are very nice looking and deliver great sound, but I can not watch a movie or play a game or let alone watch a full youtube video without the speakers popping and sound is lost.",
    "I love the sound quality from my IPad.  ",
    "I did separately purchase the accessory molded stands ($29) which (I think) angle the sound for optimum performance and complete the \"look.\"",
    "I do wish that the supplied mini-plug connector cable was longer, as well as the speaker wire, but I did adjust and was able to use them.",
    "I can run the computer through my stereo via Audioengine A1 but don't always want to use my heavy amp and my Kef 104.2's for sound; sounds great but overkill and power hungry.  ",
    "Luckily, I realized that the subwoofer can be detached from the satellites, and be directly plugged into the output on the back of the A2+ (you'll need an RCA to 3.5mm adaptor).The sound is absolutely amazing!",
    "I resorted to a direct connection from my iPhone to the A2+ speakers.  ",
    "I am using the internal DAC with USB connection.",
    "I got another DAC for my A5's which allowed me to connect the A2's to the Audioengine D1 DAC.",
    "After a few days of listening, I added an older M&K VX7mkII sub-woofer via RCA out.",
    "On the subject of expandability, if you ever wanted a little more kick from the A2+, the RCA outputs allow you to add any subwoofer of your choosing.  ",
    "It has RCA outputs, which you will need for a sub-woofer.",
    "I have it hooked up through USB, but I can also connect 3.5mm aux-in and also RCA-in all at the same time if I wanted.",
    "I have connected mine via RCA output from my 37&#34; Vizio tv, which has always had terrible sound.",
    "I did however receive two USB connectors which makes no sense.",
    "When I did this, higher frequency (1KHz) sounds were noticeably distorted.",
    "The sound seems very well balanced and I definitely heard details in certain songs that I never noticed before.",
    "I have had the A2s for a while, but noticed a channel imbalance.  ",
    "I bought these little guys to juice up the rotten sound of my 32\" Samsung bedroom TV.  ",
    "I do recommend upgrading the cables to smooth out the sound and pulling every detail from your music."
  ],
  "4376":[
    "A bit on the cramped side, but it DOES fit 13 Macbook Pro.I think I found the material \/ shape it was a little restrictive and unflexible.",
    "It's compact enough and fit a lot of my gear nicely and securely i.e. MacBook Pro Retina and iPAD Air and still have a lot of room left for all the other essential items.",
    "All 3 slots are slightly different in width and the only item that I can fit inside the widest slot was an iPhone 3GS.",
    "I ordered this bag with Thule's description stating that a 13&#34; laptop would fit, but you should easily be able to fit something closer to a 15&#34; laptop.",
    "I use it to hold a 13&#34; Macbook Air and it's tight, so not sure how you could get a Macbook Pro in there.  ",
    "This is Thule Crossover Sling pack simply too small to carry more that a Macbook Pro, iPad, and maybe my pens, pencils, and my cell phone in this bag.",
    "For something smaller, such as a Netbook or Macbook Air, this bag is likely a bit too big, but would work.",
    "I can barely fit a regular leftover dish in it to bring my lunch to work.",
    "After it arrived, I immediately attempted to fit my wife's 17&#34; dell laptop inside the largest compartment, and it was just too large to fit inside, but not by much.",
    "I couldn't even fit a box of Dextro Energy tablets.",
    "My iPhone doesn't fit there and I can't think of anything else that I might need to keep this close to me on a travel.",
    "Yes, there are several pockets you could use for a phone, but they are not reinforced and don't fit the phone snugly.  ",
    "The whole bag filled would fit in the overhead compartment of most commercial flights.",
    "The is backpack is well built like the other products from Thule but my Oakley X-Frame Sunglasses don't fit in the carrying strap.  ",
    "Keep in mind that my iPhone without a case would fit just fine, but adding a small case to it made the fit tight to near impossible to fit.",
    "It holds my Lenovo X220 with its 12.6\" screen and slice battery comfortably, but a 15.6\" screen computer will not fit.",
    "Everything, including my purse, fit in comfortably.",
    "Two adjustments that would improve it would be a larger area for sunglasses, my oakleys  don't fit.",
    "Carrying a 15\" Macbook Pro is extremely tight, and somewhat hard to zip...",
    "It is simply too tight and small to fit my glasses in there.",
    "Obviously the passport or a boarding pass won't fit there either.",
    "Great quality, but had to return it due to the totally awkward fit",
    "However, the 3 slots in the 2nd compartment are unable to store much as they are really small and tight.",
    "That all fits easily enough, but it wasn't ever comfortable once I put the laptop in.",
    "Other than that, I like this bag a lot, it's comfortable, rides snug to my body, not bulky.",
    "It fits my laptop and notebooks just fine, but hard to overpack, which is good because I have a tendency to shove way too much crap in my bags and I end up killing my back!",
    "I even have a hard time zipping up the pockets when I put the charger in.  ",
    "Does NOT have a ton of space, but I knew that when I ordered it.  ",
    "Additionally the small pocket in the strap might find its purpose at some point but in my case was too small for anything I had.",
    "I thought this pack would meet my need for a lightweight sling type pack, however it was too large & heavy for my needs.  ",
    "I purchase this bag to replace my Crumpler Messenger Bag which was bulky and heavy with my 13inch MBP.  ",
    "I use it with a mac book pro 13\" and it has all the required compartments for the accessories like power adapters, network cables, keys, etc.",
    "The bag itself will easily hold a &#34;smaller&#34; laptop up to 14 inches + an iPad\/tablet and other small electronics and a few books.",
    "There is plenty of room for my Macbook, my iPad, and my Blackberry along with keys and other necessities, including water bottle.",
    "I have some books and an iPad in there, and its pretty much full.  ",
    "It's lightweight with a well padded sleeve for my laptop, and lots of storage for cables, etc.",
    "A zippered compartment in the strap lets you stow sunglasses, mp3 player or smaller cell phones for easy access.",
    "It can hold extra shoes for work and it does hold MacBook with its case.  ",
    "In addition to storing my MacBook Air, I'm also able to stow a few large textbooks in there as well.",
    "The main compartment is huge enough for me to stuff in my MacBook, pencil case a couple of books and files.",
    "There are plenty of interior pockets including two zippered ones to keep cables andother accessories in good order.",
    "The pack is large enough to where I can have both computers in it and still have space for a few books\/papers.  ",
    "Made to protect...It fits all I need.",
    "I can carry my MBP, a book or two, phone and all my misc stuff (charger cords, headsets) and THAT'S IT.",
    "I'm 6' 1&#34; imagining how uncomfortable this would be for a smaller person is not a far stretch.  ",
    "I don't use a laptop bag very often, and mostly because I find them heavy on my shoulders and uncomfortable.",
    "and I quite often start feeling neck\/back pain after about 1 hours of carrying it on my back.",
    "I don't carry all that much from day to day --an iPad mini, a Macbook Air 13, a few legal pads, a few pens\/pencils, my Sansa Clip, in ear headphones, a water bottle and a few documents.",
    "Easily fits a MacBook 13 &#34; and an iPad ...with nice protective padding.well placed handles make it easy to pick up...thoughtful design.",
    "I`m looking for a small backpack that fit my Mac Book Pro 13&#34;.",
    "The (boxed) case for my iPad and two other packages fit in easily.",
    "The 13\" capable backpack will hold a 15 inch Macbook Pro in a pinch, with the zipper just closing.",
    "I bought this pack to hold my MacAir, iPad Mini and other travel essentials on a recent trip to Cabo San Lucas & Las Vegas.",
    "I would certainly recommend this bag IF you are looking for a smaller backpack or sling style bag to carry your computer and a limited amount of stuff.",
    "It is the perfect size and has no problem holding my mac, iPad, notebook, a book or 2, and lots of basic accessories.  ",
    "The second large pocket is compartmentalized for smaller items with a double sided mesh pocket that keeps maps, electronics and writing utensils in view.",
    "The bag fits my mac book pro 13 inch perfectly and it is very useful to have so many small pockets.",
    "In theory I guess you could zip the bag open to lay the laptop flat but that would only work if you had nothing else in the main compartment of the backpack.  ",
    "The Thule laptop bag is a handsome and very functional carrying case for my 13\"Macbook Pro.",
    "I use this with my Macbook Air.",
    "Inside the main compartment is a padded drop-in sleeve that will accommodate up to a 14 inch Macbook or laptop.",
    "It holds my macbook"
  ],
  "27226":[
    "XXL size it really a XXL, fits my 46 inch waist with out binding or feeling too tight..unlike other makers..I only use it for brisk walking.",
    "I ordered X-Large, which is 40-42\" waist.  ",
    "However, they run extremely small if you don't need them for athletic use; I have a 34&#34; waist and find the XXL fits me without cutting off my circulation.  ",
    "My waist size is 48 inches which according to the charts as an xx-large size.",
    "They would be uncomfortably tight for a 38\" waist.",
    "I recommend getting the next size up, (I wear a XL and have a 36\" waist.)The pouch is not abrasive and hugs my junk without any issues.",
    "I'm size 32 and purchased the medium one, which fits well on me.",
    "I orderd 4 of these 2black & 2 white  size 2x  which fits perfect on me I'm a thick guy  ",
    "I have a 33 inch waist and ordered the size large.",
    "I would order 32D in that case, this one would be a 32B and I'm constantly rearranging my junk trying to get comfortable.",
    "SIZES ARE; \"Large\" - 34\" TO 38\" waist  -- \"Medium\"  -  30\" to 34\" waist.",
    "I ordered XX-Large, and the straps fit fine.",
    "The fit is great and the feel is very comfortable, unlike another product that I purchased which was too stiff in the waist band, almost like leather and fell apart after only a couple of washings.",
    "Since some people seem to have issues with fit, for reference, I wear a 29 to 31 waist depending on brand for pants, and the small works perfectly.",
    "I'm about 38&#34; and bought size large, normally clothes fit just right, this jock strap is a bit tight.",
    "The jock is great for it price the waist band is a perfect fit and the pouch is comfortable.",
    "Good comfort and support, does what it should do without being overly tight.",
    "This jock is so comfortable that towards the end of my workout I can't even feel the waistband part behind me is above my gym shorts for all to see.",
    "My boys get the support they need, and the elastic isn't too tight.",
    "It still was too tight but gave a lot better than this one because it was not as stiff.",
    "It provides good snug support which I needed after a surgery.",
    "waist band is also rather tight ...even after several washings.  ",
    "I don't see how tighy-whitys, boxers and compression shorts are comfortable, they are too restrictive and get soaked while offering no support.",
    "I never cared for wide waistbands because of too much material suffocating my waist but didn't like narrow waistbands because they weren't supportive enough to hold the pouch up or dug into my hips.",
    "This waistband is breathable, not too tight or loose and i can never tell its there.",
    "This is a great jock strap - I've tried several brands and find that many of them have far too much depth in the pouch, so that a comfortably snug fit can only be achieved if the waist band is up near my navel.",
    "The band around the waist nice and wide and doesn't let you down, however probably like so many others, after a few more washings they will fit like glove.",
    "It offers good support, without being too tight, allowing you to move without feeling like your junk is all squished.",
    "I recommend the similar Duke model for much more comfort and it's still made in the US.",
    "I have a 36\" waist& Wear M in Duke brand , but ordered L for this brand because of reviews.",
    "THE PRODUCT IS JUST THE RIGHT SIZE FOR ME AS I AM RATHER LARGE."
  ],
  "27880":[
    "Samsung's PN64F8500 plasma was noticeably more reflective than the ZT and the W850A but noticeably less reflective than the VT60.I repeated this evaluation also when all TVs were completely off and the screen reflection comparisons were the same.",
    "The main advantage of the ZT60 under bright lighting was somewhat less reflectivity\/screen glare.",
    "On the other hand, the ZT has the lowest screen reflections of any TV (plasma and LED) I saw at Best Buy (see more details below).",
    "Interestingly, all TVs appeared to have somewhat worse screen reflections when viewing from an angle than when viewing from straight in front of the TV.",
    "No Camera* No Side Front Firing Speakers* Less Brightness* Better Filter* Studio Master Panel with No Air GapCompared to F8500, ZT has:* No Camera* Less Brightness* Less 3D Resolution*",
    "As stated, the anti-glare properties are better than I have seen on lower tier sets, but it is still a glass panel and reflections still occur.  ",
    "Best ever PQ with special construction and filter to reduce glare in a bright room.  ",
    "I can't imagine this TV not being bright enough for someone except for maybe if it's placed in the very brightest of rooms.",
    "The filter handles glare well compared to lower tier plasmas.  ",
    "As with all plasmas, the screen is glass so if you're in a very bright room or if there are windows opposite your TV you may want a TV with a matte screen.  ",
    "Both RP's had no reflection other than a very muted bright area in some viewing angles.",
    "Panasonic's' Plasma TVs have fabulous black levels and this can make for a darker TV in a bright room.  ",
    "Environment:  We have our TV in a very bright room with a full west facing window wall on one side, and also windows on the back wall but to the side.  ",
    "The set is also great in dark or brighter rooms.",
    "The one sheet of glass design produces significantly reduced glare.",
    "The Studio Master Panel does an excellent job reducing glare.  ",
    "My living room has four windows that always catch sunlight plus a lamp is usually on but even with all that, I really had to squint to find any glare or reflections.",
    "Otherwise the picture may lose some details in dark scenes, or even be too bright, depending what picture setting you select.",
    "One example is  the Panasonic 65\" ZT Series Plasma HDTV, which was placed directly in bright lights in the hhregg store.",
    "I'd heard that the brightness might not be as strong as others and visibility was not optimal in a bright room.",
    "They're not as blindingly bright as most LCD's, but in my bright room this picture still kicks butt.",
    "P65ZT60 Highlights:Incredibly good picture quality from high-quality HD inputs; the best picture quality of any TV for watching 1080 HD programs at home from usual viewing distances; exceptional black levels and picture contrast; great picture details even in dark and mixed scenes; very natural, accurate and truly deep, solid, rich and smooth colors (including white color); natural and smooth skin tones; 2D picture looks almost 3D in high-quality scenes with edges of people and objects clearly defined and separated from the background; great motion handling; great for watching sports, movies and any other programs; no color blooming or light bleed that is observed on LED\/LCD TVs; very good picture brightness and lowest screen reflections of any of today's TVs (plasma and LED\/LCD) which makes it suitable for brighter rooms as well; excellent picture quality also from all side viewing angles (immensely better than LED\/LCD TVs); very good picture adjustments and factory pre-set picture options; THX certified picture settings; standard definition (SD) picture quality (via HDMI input) is as good as on any other high-end TV; nice and discreet TV frame and stand without noticeable light reflections; very thin TV profile - as thin as most LED TVs; nice and intuitive TV remote control.",
    "Many reviewers  have said that the screen is too reflective and that there are problems operating the remote control on these models though.",
    "Its reduced screen glare\/reflectivity, its practically perfect black level, the great reproduction of shadow detail, and extremely accurate colors have seduced me already.",
    "Reflections are normally not a problem on bright scenes on any TV.",
    "The ZT has a nice and discreet screen frame and TV stand that do not reflect the ambient light much or in any distracting way.",
    "Samsung has the advantages of being super sharp, super bright, and having no \"Fan Noise\" issue.",
    "You can have the W850A brighter than the ZT, and some people may prefer it that way, but to me that usually means sacrificing some picture quality.&lt;&lt; Screen reflections >>",
    "When the screen fades to black, I see the reflections of myself and the windows.  ",
    "What's nice about this Panasonic is that the screen (panel) takes up virtually all of the viewing area so all you're looking at is the screen and no large border to reflect ambient light.",
    "The screen on the Samsung 75\" Series 7 LED HDTV - UN75F7100, is also just as reflective.",
    "The samsung screen is much like the vizio, extremely reflective to any object that may be in front of it.",
    "Setting picture mode to 'THX Bright' or 'Vivid' helps a bit but, it will not eliminate reflections when a dark scene, or portion of the screen, occurs or when the screen fades to black (in that case you momentarily have a very expensive mirror).  ",
    "My VT60 had better picture quality than the W850A in my viewing environment where visibly worse screen reflections of VT60 were not a big problem.",
    "Even the screen front frame on the W850A, being essentially shiny black, was visibly reflective in my room setup.&lt;&lt; Summary >>",
    "The W850A has a very shiny\/reflective and thick TV stand that I felt at times I wanted to cover with something.",
    "The screen is nice and bright and crisp.",
    "This Plasma TV has the best color I have ever seen on an HD TV and it does very well in my bright living room.",
    "3D works extremely well; picture is bright and clear with great depth.",
    "The screen brightness is very good.  ",
    "Those Professional settings produce virtually identical picture quality to the THX Cinema factory preset on my ZT60, including brightness, sharpness and color accuracy, and they are much friendlier to the TV regarding image retention (IR).  ",
    "The colors are fantastic and the blacks on this TV are unbelievable.",
    "Like with any other TV the picture brightness also depends on the brightness of the source content, not just the TV settings.",
    "The picture is great on this TV...!!!I would give it a 5 star rating, but the flash software already needs updated, and there is no way to do it....",
    "In one \"angled\" seating position the reflection was too much to ignore.",
    "With windows and\/or lamps opposite the screen and behind me, I see those reflections on screen."
  ],
  "15025":[
    "Like most mid-grade shoppers out there, I wanted a quality, stable tripod that was (relatively) compact.",
    "Small, compact and study for a travel tripod.",
    "Until now I just hadn't found one that I thought would be sturdy enough and still fold to under 20 inches, while not costing an arm and a leg.",
    "This tripod folds down to 13&#34; and is light enough to carry around all day.",
    "This tripod folds down VERY small, all the way to about 12 inches so it will easily fit in my carryon.",
    "This is the smallest tripod I have ever seen.",
    "The case for the tripod is about as wide as most camera bags and I found that it was easy to hang it from the two carrier straps with two Carabinder clips.",
    "The best feature of this tripod is its very compact size when folded &#8212; just about a foot.",
    "My walk around vacation camera is only a canon G15, this tripod didn't even break a sweat supporting that little thing.",
    "I've long wanted a very compact tripod that could be easily stowed on a motorcycle.",
    "I needed a smaller, lighter and more compact tripod.",
    "I highly recommend this tripod to anyone that is interested in a lightweight, compact tripod for a relatively small video camera.",
    "Dolica TX570 Tripod  is a very compact tripod, it is a Little heavy for his size, but stable.",
    "This tripod is well designed,quite sturdy and light weight,folding to a mere 12&#34;.",
    "I had it up and running in no time and i like how incredibly small and light this tripod is.",
    "It weighs about as much as a \"regular\" lightweight aluminum tripod but it folds up much smaller.  ",
    "I found this tripod is very sturdy, compact enough to fit in my backpack, but also extend high enough for use as needed.",
    "What I love best about this tripod is compact enough that I can place it into a carryon bag without a problem.",
    "So if you occasionally need a tripod or use one often while traveling or out in the field, I would recommend this is worth the price, especially considering the quality, size, and weight.",
    "If you're looking for a compact and light travel tripod that doesn't cut corners on quality (meanwhile not breaking the bank) look no farther.",
    "This most compact light weight tripod is well made, very sturdy solid built and also most affordable price and best buy.",
    "This is a nice little tripod, my primary consideration was priceand at this price point the Dolica is a good deal.",
    "If you're in the market for a very compact tripod at a low low price, you can't go wrong with this Dolica.",
    "For an affordable tripod, the build quality is top notch.",
    "This unit is not as sturdy as the Manfrotto, but the head is quite decent, as well as a better tripod option for 1\/3 the price.  ",
    "It is good as Mefoto or any expensive brand.",
    "Twenty years ago it would have been difficult to find a tripodthis good at any price.",
    "The Beike 555 was a good price",
    "IN SUM:For this price, I like it.",
    "I am very impressed with what I got for the price.  ",
    "Great for the price, but don't expect anything from the case as the zipper broke the first time I used it.",
    "Given the price and the size, it's not bad.",
    "Consider the low price, size folded and fully extended and it is unbeatable.",
    "BALL HEAD:Exceptional at this price.",
    "Shipped on time, just as I expected nice size for the price.",
    "It's a good trade off, especially for the price.",
    "I spent a little more on this one but it is worth it.",
    "If you want a compact tripod, this is a nice choice and seems to be a value for the build.",
    "All in all, this is a great tripod and well worth the money.",
    "I needed something very light to use as a travel tripod.",
    "Everest and no tidal waves were banging against it but it is rock solid (in my opinion) and more secure than my Manfrotto travel tripod.",
    "I wanted a small travel tripod that was sturdy enough to hold my compact point and shoot camera but could also support my iPad I've started to use more for photo and video work.",
    "Though I do not do much landscape photography or shoots that require a tripod, there are times when I need it and to have a product that is lightweight and compact to travel with is great!",
    "Even the carrying bag is pretty solid quality.",
    "Because the materials are top-notch but not carbon fiber\/fiberglass, and build quality is good, you should expect that there will be some weight.",
    "It is light in weight, but surprisingly substantial in quality.",
    "DO IT great for hiking and camping, not one ounce of plastic on this thing for structure.",
    "Without extending the column sections, this tripod is rock solid.",
    "When I go out specifically to shoot nature or landscapes I have an amazing (heavy) tripod with an awesome ball head.",
    "This little tripod is way sturdier than anything else I have found anywhere near its size.",
    "They will not work very well on rough terrain but I acknowledge there was a tradeoff to be made between tripod size and weight and feet size and sturdiness.",
    "The tripod was sturdy enough for my heavy Nikon F4 but I used shorter 24 & 50 mm lenses, would have had trouble supporting long lenses.",
    "The tripod feels very sturdy.",
    "It is sturdy enough to hold my Canon 60D for moderate times exposures (30 sec with a wide angle lens at night) without tripod shake.",
    "I was looking for a very light but sturdy full-size tripod for an upcoming trip.",
    "A good light weight tripod which does the job as it says.  ",
    "This tripod is very portable, but the head does not support the weight claimed.",
    "Everything about this tripod is about reducing bulk and weight.- The twist latches on the legs leave nothing to stick out-",
    "This thing is sturdy, has a hook at the base to weigh the tripod down should you fully extend and not wish to see your camera eat dirt.",
    "I do a lot of beach landscape photography and this tripod has worked well even under some windy conditions (with a weight on the center column like I would use on any other tripod).",
    "If your looking for a light weight, portable, functional and reasonably priced tripod for travel use, this is the one to get.",
    "At less than half the cost of the MeFoto it was a no ' brainier.  ",
    "I was lucky enough to find this tripod on Costco.com (buy it there if you have membership cause it's only $70).",
    "For the size and weight, this tripod is hard to beat.",
    "It does the job of ultra compact lightweight tripod with of course some trade offs.",
    "The Dolica TX570 tripod is certainly not built as well as higher priced tripods and although I did not test the tripod at its higher height ranges, I still feel it is well worth the price.",
    "One thing Dolica needs to work on is the quality of their bags.",
    "This tripod has a low quality production.",
    "The quality of this tripod is very good.  ",
    "I didn't do anything with it that I thought might exceed it's limitations, but honestly the head did seem to be of a slightly higher caliber than the legs.",
    "I wanted a small tripod for my backpack with great quality and this is it .",
    "The material quality is ok.",
    "The build quality seems exactly the same as a nearly exact twin from another brand which costs over twice as.  ",
    "Samsung NX20).The build quality of Dolica TX570 is very good &#8212; essentially the same as MePhoto RoadTrip.",
    "Again, the quality of mine was superb, but that doesn't mean that all will be exactly the same.  ",
    "Hope the quality is just as good as the shipment.",
    "This is a very nice built tripod.  ",
    "Lastly, I feel as though the tripod legs could have been made better.",
    "This one is a bit too heavy and too big for my needs.",
    "I ended up with this one and I really love it - although, I didn't consider that it might be a little heavier than I would really want to carry around in a day pack.  "
  ],
  "19105":[
    "It gives me at least SOME salty flavor without all the harmful contents.  ",
    "It does taste salty, but it is free of sodium and potassium.",
    "I was using kelp because it's slightly salty, a little fishy tasting, but I used it because it was the closest, most natural without being too high in sodium.  ",
    "I wanted something to use on bland foods like eggs, baked potatoes ect, not a sub for salty flavor to me, but not bad tasting like Potassium Chloride.",
    "I would consider this a decent seasoning to give items flavor without using as much or any salt.",
    "I thought for sure it would only taste like a sodium-free spice blend like all the rest, but it actually has a salty taste when you try it right out of the bottle.  ",
    "This seasoning does has a salty flavor and has added some quality taste to such a bland diet.  ",
    "Not really a salty flavor.  ",
    "I would not call it a salt substitute yet there is a slight salty flavor to it.",
    "I tried this seasoning and was pleased with the salty flavor.  ",
    "Benson's has a rich salty flavor and no after taste.",
    "If you dissolve them in water, they has little or no flavor at all, and what flavor they do have is nothing like sodium chloride.",
    "It is COMPLETELY SALT FREE and also potassium chloride free (potassium chloride has an odd after taste and does not give you that zing you get from salt, so you wined up using a lot more).",
    "\"salty\" despite having no sodium.",
    "While it doesn't taste just like salt, it does have a salty taste and I use it with salt to cut down on the amount of sodium I use.  ",
    "I was able to eat everything the chef prepared without an ounce of salt.",
    "I actually don't miss the salt at all - and I will never be without it again.  ",
    "I get very little salt taste, instead it has seasoningssimilar to other spicy substitutes.",
    "Well since this purchase their appetite has come back and the good thing about this seasoning is it has no potassium chloride and no salt but makes food taste amazing.",
    "while it has no sodium as stated it is way over priced for what it is ,and what it is is tastless!!!..",
    "When I put it on my food there was no salty taste.  ",
    "This is the first 'salt' substitute that acctually has a salty taste.",
    "This is a natural, tasty, salty seasoning, and there's no aftertaste.  ",
    "Not really a salty taste but has a really good taste.",
    "Its just some spices and wont give the salty taste.",
    "It does contain a mix of ground herbs which provide a boquet similar to Mrs Dash's, but again, guys and girls, this one actually tastes salty!",
    "I bought this based on some online recommendations and I was sceptical, but this really tastes salty!",
    "I am very skeptical that this has some chemical in it to make it taste salty",
    "Definitely has a salty taste to it, and the rest of the spices are pretty yummy as well.",
    "I can't believe there is no sodium in it, I feel guilty for shaking it on all my veggies, and salads everyday.  ",
    "and I found it to be good, strong flavor but not salt..nothing beats salt, but also Salt is indeed a reasonable substitue and if you have severe congestive heart failure, you will like that product..not love it, but welcome it as a flavor enhancer.",
    "Would recommend this to anyone that needs a little flavor, but doesn't need the salt.",
    "They add flavors to be sure, but still no salt-like kick of flavor enhancement.",
    "Tastes like a glorified version of Mrs. Dash and far from salt flavor.",
    "Herbs and spices.  Has no flavor that substitutes salt.  ",
    "This is the first product we came across that actually had a salty taste.",
    "This product actually has a salty taste.  ",
    "this is EXCELLENT, because so many No Sodium items are still HIGH in Potassium.  ",
    "I've been diagnosed with three different physical conditions, each requiring special dietary needs--mainly low-salt, low-potassium and low-carbohydrate--which doesn't leave much in the way of flavor or food enjoyment.  ",
    "I was recently told I needed to reduce salt for health reasons and I was so happy to get the Table Tasty and try it.",
    "Most salt substitutes are filled with potassium, but not Table Tasty!  ",
    "Most others use potassium which is a poor substitute, or various herbs and spices to make up for the missing salt.",
    "I purchased this someone very close to me who has kidney issues and they have to closely monitor their salt and potassium in take and I must say I've finally hit the jack pot with this seasoning.",
    "I didn't know what I would eat when I couldn't have salt,nor could I use any substitute with potassium.  ",
    "I am on a highly salt restricted diet (and potassium too.)",
    "and I am on dialysis and cannot  have sodium.",
    "Perfect for the low sodium diet.",
    "I've been searching for a no-sodium table seasoning, and this stuff rocks.",
    "A good salt substitute for those that are on a Sodium reduced diet.  ",
    "It is fabulous and does not contain potassium chloride (which I can't use due to some medication I'm currently taking).  ",
    "I would recommend this to anyone who is on a low sodium or sodium free diet.",
    "My mother has CHF and was told to strictly watch her salt intake, ahe cannot have potassium chloride either (which is many substitutes.)",
    "This has a wonderful salty flavor and I have been using it in place of salt in all my recipes with great results.",
    "It is costly, but if you want to use less salt but still want that salty flavor, this does the trick.",
    "It has a slightly salty flavor (the first ingredient is nutritional yeast extract, which apparently gives the salty taste).  ",
    "It's hard to recommend this to a friend but, maybe worth having in the cabinet if, you need to have a &#34;kind of salty taste&#34; going on.",
    "I swear its salty.",
    "I like my food to taste good so I am desperately looking for a salt substitute that has a salty taste.  ",
    "it has saly taste if you stick your finger in and sample it,but when you sprinkle it on cooked food the flavor totally dissapears,you have to poor it on for any flavor and at the price of $30 way over priced .my",
    "Plus, it has miniscule bits of carrot, red bell pepper, onion, dill weed, parsley, basil, allspice, and paprika, and imparts a great flavor to anything I use it on.  ",
    "Personally I wouldn't really compare it to salt (it's different from that to me) but it's got a lot of flavor.",
    "I liked adding spices rather than pouring on the salt and I was pretty generous in he portion size as I used this and found that it did add flavor, no doubt about it.",
    "Has nice flavor",
    "Has a nice flavor with just a little more zip than some of the salt substitutes.  ",
    "Great taste and flavor.",
    "A little dill flavor and a faint cheesy flavor.",
    "added a pretty good flavor especially to scrambled eggs.",
    "This salt free seasoning has the best flavor of any salt substitute I have tried.",
    "It gives food that tasty zing that it lacked without salt before and now my meals are wonderful and tasty again.",
    "It doesn't rely on potassium chloride, nor on only \"herbs and spices\" as other substitutes like Mrs. Dash or the (in)famous Costo seasoning does\/do.",
    "My mother is restricted to a low sodium and potassium diet.  ",
    "I am on a low sodium diet because of kidney disease and high blood pressure.  "
  ],
  "6270":[
    "These Indian-style Madras lentils have a little bit of a zing, but they're not spicy.",
    "They are not spicy at all which is great for me since I don't like a lot of heat.",
    "These lentils are very tasty, not to spicy.  ",
    "It's not really spicy, just tastes like chili.",
    "It does rank on the medium spicy range so if you are averse to a little heat with your meal I would suggest one of the other more benign Tasty Bite meals (such as Agras Peas and Greens).",
    "I found it somewhat bland compared to what I like...hot and spicy.",
    "I really wanted to like the Bombay Potatoes but even over a generous helping of rice it's just too spicy, It has a good flavor but there's just too much heat in the mix.",
    "I will say, this is Indian food Lite, as in its processed food, and the spicing is mild.",
    "Great and spicy tasting!!",
    "The sauce is wonderful and spicy.",
    "Excellent flavor since we love Indian food.",
    "It's got a good flavor but it tastes nothing like Indian food.  ",
    "It's like Indian-spiced chili - yum!",
    "This one in particular I found to be extremely filling.  Tastes just like a mildly spicy beef chili without the beef.  ",
    "I'm mostly vegetarian (I try to avoid as much meat as I can), and I love savory and spicy foods.",
    "Not spicy, not too salty, lots of protein (12g for the whole packet), soft and mushy (in a good way).",
    "I really like this product a LOT, and though for my taste it is a bit too spicy."
  ],
  "756":[
    "The compartment doesn't fit my cell phone or touch ipod.",
    "I can't put my phone in the basket inside, because it's too large (droid Incredible), but it fits without the basket.  ",
    "My iPhone fits nicely, not sure if the bigger cell phones will fit.",
    "However I received a newer phone (nexus 4) and it won't fit inside the unit - the lid needs to be completely closed to operate.",
    "It even fits the Samsung Galaxy S2, but anything bigger than that will be a stretch.",
    "While Violight was able to fit my smaller HTC, it was not able to do so with a case or fit my larger Samsung S III.",
    "It's too tall to fit unless you remove the interior basket that suspends the item away from the walls.",
    "I think this is a great product but unfortunately, my Motorola Droid doesn't fit - even when I remove the basket.  ",
    "Has small basket to hold other items besides just a phone.",
    "Fits all size phone if you remove the inside basket.",
    "The description should be specific as to what phone this will fit.  ",
    "My question is, What phone does this fit?  ",
    "However I recently upgraded my cellphone to an HTC EVO 4G LTE and the phone is too tall to fit into the VIOLight.",
    "This worked great for all my apple products but is too small for Samsung Galaxy S4.  ",
    "My husband and I both have Samsung phones and they do not fit.  ",
    "I rated it down one star because it is too short for my new iPhone 5, which makes me think it is limited as too what phones will fit.",
    "Cell phones are getting bigger so I'm not sure why the basket it so small.",
    "There needs to be a disclaimer on this product: It is too small to hold modern cell phones!  ",
    "There is a little basket that you put your phone in to clean it.  ",
    "I had an android that fit nicely into it.",
    "And FYI it does fit up to the I Phone 5, not sure about those big samsungs but the I phone 5 with no cases",
    "With the new trend of touchscreen cellphones increasing in size, this product won't be future proof and unfortunately the company currently doesn't offer anything to accommodate taller cellphones like the HTC EVO 4G LTE and Samsung Galaxy S3.",
    "Larger or thicker phones won't fit.  ",
    "If you are cleaning an iPhone case like myself, some of them don't fit properly.",
    "I use a very thin, low-profile case which adds very little to the overall bulk, but it simply doesn't fit.  ",
    "My iPhone 4 with a normal sized case fit nicely.",
    "I can disinfect the case SEPARATELY by removing it from the phone because the case has a little give, but it requires me to apply pressure to the top of the housing while it's doing its thing.  ",
    "But the fatal flaw for the iPhone 4s is that the phone only fits WITHOUT the case.  "
  ],
  "16455":[
    "if used properly no blisters appear, no breakage of skin",
    "The Miaderm seems to help the skin repair itself, but I've found cocoa butter to be an absolute necessity to keep the skin moist regardless of what other creams I've used.",
    "I bought this before radiation, used it 3 times a day after, and I had minimal skin redness, and skin was not painful.",
    "Since his first round several years ago, he has struggled with patches of tight, leathery skin from the radiation burns.",
    "Miaderm Relief decreased the dry, red, irritated skin and sensitivity to light.",
    "It soothes my red and blistered skin like nothing else!  ",
    "It really helped to save my skin from further pain and irritation.",
    "It provided instant relief and soothed my skin.  ",
    "I had no blistering or cracking of my skin.  ",
    "During and after radiation for a cancer on my  nose Miaderm helped keep the redness down and upon completion really made a difference in a rapid recovery and the skin on my nose is so smooth now.",
    "Burned my skin.",
    "Because it dries quickly, it probably dries out the skin as well.",
    "After very busy day and neglecting my usual  liberal applications my skin felt sore and noticed more redness.",
    "He liked it because it did not have a scent and it did work well for his dry skin.",
    "Miaderm lotion helps with the itchyness of the dried skin and also leaves your skin feeling soft.  ",
    "This cream seems to help their dry burning skin.  ",
    "They have both had problems with intestines and with their skin.",
    "It keeps the skin soft and eases the redness from Radiation.  ",
    "Also, it made my skin very smooth and soft.",
    "My mom had to get radiation therapy and this kept her from having any rashes or skin troubles.  ",
    "Radiation treatment causes the skin to tighten and dry out as well as turn red like a bad sunburn.  ",
    "\"Boost\" treatment during the last phase are more intense, focused more on the site of the former tumor, more likely to cause side effects, such as burning of the skin.  ",
    "I would be VERY hesitant for anyone using this product with sensitive skin, much less those who are going through treatment.",
    "Cons:It is scented - not good for people who having gone thru or going thru chemo and get sick from scents.",
    "Also purchased ia  for a friend who will be having radiation treatment following chemo.  ",
    "This is used for burns from radiation treatment and works well.  ",
    "I used Miaderm for relief during a recent 7 week radiation therapy.  ",
    "While nothing can reverse the effects of radiation on the skin during treatment, Miaderm has helped reduce irritation and itchiness.",
    "The oncologist recommended alcohol free Aloe Vera, but he found that it burned his irritated skin.",
    "She puts it on immediately following her daily treatment and hasn't experienced any issues with her skin after 25 radiation sessions.",
    "Miaderm has a creamy texture that really felt soothing on my sore skin.",
    "I went to Amazon and find this cream, now I am on 4th week of radiation, skin color is little changed, but no burning sensation, no blisters, thanks God!",
    "I am having radiation and Miaderm really soothes the skin where the treatment is.  ",
    "Doctors told us this worked really well for the skin during radiation treatment.",
    "Bought this for my mom undergoing radiation therapy and her skin is doing great.",
    "I have just finished my treatments but will continue to use this product until my skin is fully healed.",
    "after radiation the miaderm worked well and my skin finally returned to normal.  use as directed 2 x a day",
    "Took care of my skin during radiationk treatments.  ",
    "One of my friend just finished 7 weeks radiation and chemo for a throat cancer (level 4) and his neck was badly burnt by the radiation:Miaderm cream did a great job.",
    "I used it every day after treatment as well as before going to bed and my skin has held up very well.  ",
    "I faithfully used it every day and I think my skin post-lumpectomy and radiation maintained pretty well.",
    "Have used this throughout radiation treatment and skin is doing wonderful.  ",
    "I would recommend this product to anyone undergoing radiation for the soothing it provides.",
    "I've used Miaderm mostly at the end of the radiation process for healing.",
    "The technicans, doctors, and radiologist were amazed that the only the effect the radiation had was a very slight reddening of the skin which disappeared when treatments stopped.",
    "Skin never blistered and recovered quickly (I have very fair skin and expected the worst).  ",
    "My skin is doing great.",
    "My skin feels great, all traces of pinkness are gone.  ",
    "It saved my skin, thank G-d.",
    "It feels very soothing to the skin when applied, and doesn't stain clothing.  ",
    "It did not take long for my skin to heal.  ",
    "I'm in my 5th week of treatment and my skin has that cooked lobster look, but three daily applications of Miaderm help me get through the day with a minimum of discomfort.",
    "I caught it fast enough, I think, so I'm pretty sure my skin will recover well enough before the first radiation treatment 2 days hence.",
    "His skin is much more pliable post-radiation this time, and the itchiness is much less.",
    "It is very soothing to the skin.",
    "My doctor recommended it and said my skin did greatI am still using it and will until my next surgery is over",
    "Great for your skin and helped my scar fade tremendously once I started to use it.",
    "And now, after 2 weeks of using the Miaderm his skin is back to normal.  ",
    "Since I have eczema I felt it would be best to start right away and faithly put it on nightly before bed so as not to interfere with the treatment the following day.  ",
    "Miaderm helped me going to 30 sessions of radiation.",
    "Many factors are involved - length and strength of dose, an individual's skin condition, etc., but, so far, it seems to be working well.  ",
    "Would highly recommend this product for anyone experiencing radiation burns.",
    "I used this right after I finished radiation.  ",
    "I used this product twice daily during my radiation treatments.",
    "I used it for over 2 months during and following radiation treatments for breast cancer.  ",
    "I used it 4 times a day and I brought it with me to my 33 radiation treatments and applied it in the changing room after each treatment.",
    "I used it 2x daily beginning the day of my radiation treatment and continue using it a month later.",
    "I recently used Miaderm for radiation burn therapy in a 6 week treatment.  ",
    "Another friend used it (not paying attention to directions) and got radiation burns.  ",
    "While it may seem a little pricey, I have used this cream for 7 weeks of radiation and it is worth the price.",
    "In speaking with other women at treatment, the ones that didn't use Miaderm and used a less expensive cream ended up burning badly.  ",
    "Would recommend to anyone undergoing radiation to use this product",
    "I'm very fair skinned and didn't have a bad skin reaction until treatment 25.  ",
    "I only have one more week of radiation left and my skin is doing great.  ",
    "I have had twenty treatments of radiation for skin cancer.",
    "I have very sensitive skin so I was concerned about how my skin would react to the radiation treatment.  "
  ],
  "28010":[
    "It is easy to clean (both the carafe and the tea holder).",
    "Not easy to clean after Orange Pekoe type of teas.",
    "Clean up is very easy as well.",
    "Clean up is easy.",
    "The carafe itself cleans up well even with tea left in it for long periods of time and I notice there is no staining, however the tea holder part inside is stained from the black tea we drink.",
    "Tea infuser is hard to clean.",
    "Consequently, it stains easily and will never come clean.(2) The karaf has a silicone seal where the glass meets the metal base which smells terribly strong at first.",
    "poor quality, lid does not fit, strange and inconvenient turn on and shut off buttons, difficult to clean and the outside gets hot",
    "It works great the only thing is the clean up.",
    "Its just a Little hard to clean the infuser since the top doesnt go off.",
    "The plastic does stain after a while but when you see this starting to happen you can clean with a little vineger.",
    "It will stain after a few uses, but that does not affect the quality of the tea.",
    "TIP 1: To avoid chalky hard water stains on your glass karaf or the metal base, I recommend using distilled or filtered water.",
    "I hope I'll be able to remove the tea stains with a cleaning it calls for on a regular basis.",
    "After 2 1\/2 months my tea maker came home dirty, with tea leaves\/water inside and in seriously worn condition.",
    "If you have let it stain bad you can use a small amount of bleach or if you are afraid to use bleach you can buy the coffee maker cleaner from the store and use it by the directions.",
    "Since I brew my tea IN the kettle the plastic insert and bottom turn brown with time."
  ],
  "9139":[
    "love the fact that this blender is easily 1\/5 the price of Vitamix, and yet right on par in terms of power and warranty.",
    "Well, this blender is the first one that I can say absolutely is comparable to the Vitamix and probably more favorable because it has a better price tag and more features.  ",
    "The Versa offers many high-end blender features that are on par with the Vitamix, but for $100+ less.",
    "Not bad for a blender comparable to a Vitamix.",
    "I like that the Versa came with a very nice quality cookbook and also included a tamper, in fact the jar is almost identical to a Vitamix.",
    "not  bad... just lower quality than the Vitamix.  ",
    "Quality-this blender feels and looks solid so I would expect it to last long.",
    "Now, I tried to look for the best blender within my budget without sacrificing quality and taste, and the Oster Versa did not disappoint.",
    "This is a sturdy, well built blender.",
    "I made a batch of green smoothie one day in the Vitamix and the next day in the Oster to compare and the results were identical.  ",
    "I have never used  a vita mix blender so i can't compare the two, but this versa is very powerful.",
    "Was looking for a comparable blender to a vitamix for less $$.",
    "This blender has a 1400 watt motor, which is the equivalent of the Vitamix 2 HP engine.",
    "The Oster Versa Performance Blender is a powerhouse that rivals Vitamix.",
    "If your looking at a Vitamix or Blendtec, I would say also consider this awesome blender.",
    "If you are in the market for a high-performance blender and are considering a Vitamix, take a look at this Versa.",
    "At the current price of $266 my opinion is that this is a great value for any one who wants a vitamix class blender.",
    "All of them are better than average, especially the Vitamix, of course, but the $200 price difference is the biggest difference between the awesome Vitamix and this Oster Versa Blender.  ",
    "Overall, this is the best blender I've ever had and I've used a friend's Vitamix and it is *almost* on par.  ",
    "After doing ton's of research, I had narrowed down my choices to this blender, along with a Vitamix and a Blendtec.",
    "My initial impression of the blender on taking it out of the box was it didn't feel as sturdy as a Vitamix...",
    "This seems to be equal to the Vitamix.  ",
    "The pitcher of the Oster even fits onto the Vitamix base.  ",
    "The Versa is quieter, has pre-programmed buttons for smoothies and butters\/spreads, and, in my opinion, looks better than the Vitamix, even the Creations Elite.  ",
    "Often they just aren't close to my Vitamix in comparison.  ",
    "Ive used a vitamix before and I actually feel like clean up is way easier with the versa and it blends just as efficiently as vitamix.",
    "It works just as well as my neighbors Vitamix, you will not notice a difference in the results between the two.  ",
    "It is louder than a Vitamix, but luckily it is so powerful that it doesn't have to be on that long.  ",
    "I still like the price, look and performance of the Oster over comparable Vitamix blenders but I'm not so sure which will end up being less expensive to own over the course of 7 years.  ",
    "I have used the Blendtec and Vitamix and this is just as good for much less.(Amazon was selling it for $150 when I purchased it!)",
    "I can't imagine the Vitamix doing anytthing more than what the Oster does at literally a fraction of the cost.",
    "I bought it in hopes that it would deliver Vitamix standard results for a fraction of the price.  ",
    "I believe it performs every bit as well as a Vitamix at less cost.",
    "For $70 less you can buy this versus the Vitamix.  ",
    "Cons: Since we're comparing to Vitamix - Does not have the super low speed like the Vitamix.",
    "In fact, my friends VitaMix carafe fit's on this.",
    "I was trying to get something that would make my protein shake\/fruit smoothies as smooth as my old Vitamix without paying $500, I took a chance on this Oster since the reviews were all good.",
    "I also tried a friend's Nutribullet and it didn't do as good of a job as either the Vitamix or Kitchen Aid.",
    "That said I just have to run it a little bit longer than a vitamix and it does an excellent job.  ",
    "It was great but not quite as good as the VitaMix.",
    "I got it with a coupon so it ended up costing something like $200 less than the Vitamix I was looking at.  ",
    "Enter Oster Versa!This thing is hands down on par with my old roommates VitaMix.",
    "My OSTER VERSA is performing like the Vitamix I tried previously.",
    "Is it as good as another blender that costs hundreds of dollars more......who knows.",
    "But take it from me: from my experience withthis blender thus far, it trumps both the Blendtec AND the venerable Vita Mix, and costs far less than either of these.",
    "This is the most powerful blender I've ever used I've wanted a VitaMix blender for over 20 years now.",
    "You will notice immediately the difference in power from your standard blender.",
    "When we needed a new blender to replace a 20-year-old Sunbeam model, we selected an Oster Classic blender because of its sterling reputation and its ability to crush ice and blend frozen fruit.",
    "This review is for the Oster BLSTVB-000-000 Versa Powerful Performance Blender, in Black.",
    "This is the most powerful blender I've ever used, it's truly amazing and makes the BEST beverages I've ever tasted.",
    "This is a very powerful blender which suits a wide variety of cooking purposes such as making smoothies, soup, sauces, dips, and desserts.",
    "This high performance blender is fantastic.  ",
    "This blender makes such quick work of everything I throw at it that I've been sorely tempted to try and blend bad things like cell phones and watches just to see how it would handle it!",
    "This blender is so powerful it makes it very easy to make delicious smooth dips.",
    "This blender is excellent!",
    "This Oster blender is amazing!",
    "The size doesn't bother me because after all we're in super blender class here right?",
    "The only blender I've seen with more power is a Blendtec (of the Will It Blend? fame), which is 1560 watts.",
    "The blender performs beautifully!",
    "The blender needed to be taller and more powerful.",
    "The Versa is a loud blender.",
    "The Oster blender is amazing.  ",
    "Taste Test-there is a difference to blending with this high power blender which can reach  28,000 RPMs and we notice that things are smoother.",
    "Its very powerful, but don't expect a blender to completely pulverize say frozen black cherries entirely of it's skin or fiber.",
    "It's a great blender.",
    "It does everything I would ever want from a blender, and I bought it on Amazon with an e-coupon which made this ridiculously cheap versus some of the more well known high-power blenders.  ",
    "In summary: the Oster Versa is big, powerful and well made, but it's still a blender.",
    "If you are looking for a large, power blender for a variety of blending, chopping and cooking purposes.",
    "I would recommend it to anyone wanting to make smoothies or just a real good high performance blender.",
    "I give this blender 5 stars not only because it intimidates me with its powerful roar, but also because it does exactly what is promised blends and purees without hesitation or remorse.",
    "Holds almost twice capacity from my previous blender.  ",
    "Finally...a blender that is powerful and whips up a smoothie in seconds.",
    "As the years have progressed, I've noticed a lack of power in some of the blenders I've had for use, BUT there is no lack of power with this beautiful blender.",
    "Powerful blender, no problem shredding up whatever I put in it, fruits, veggies, ice.",
    "My two concerns would be that the blender doesn't do as well eliminating the small bits of food as I would expect, and because the blender is so powerful it is real finicky at keeping a smooth blending motion.",
    "Awesome blender.",
    "The problem we had with the Vitamix was the cost so we decided to search the market and see if there was a Vitamix-comparable blender at a cheaper price.",
    "So I was please to see this comparable blender at $100 cheaper than the lowest price I've seen for a new Vitamix.",
    "So I'm very happy with my purchase because I got the Versa for less than half the cost of the Vitamix!!!!!The only thing in question now is durability and dependability.",
    "I thought I was being silly reviewing so many blenders, Ninja no, Vitamix very costly, etc etc.",
    "I think it will give the VitaMix a run for its money, as this is about half the cost.",
    "I have tried two Vitamix blenders, the Hemisphere, a cheaper ($59) Oster, and a Nutri Bullet.  ",
    "I am thrilled that I took a chance on this and saved over half of what I would have payed for a Vitamix.",
    "For the difference in price between this and a Vitamix; I think I can spend an extra 10 seconds and come out ahead of the game.",
    "And if I were in the market for one of these, I'd save the money and buy this one over the Vitamix.  ",
    "If you're looking at uber-blenders (I'm looking at you there, drooling over that spendy VitaMix), I HIGHLY recommend this one.  ",
    "Time will tell...Pros: As good as blender more than twice the price!",
    "Oster has introduced a new powerful performance blender to the consumer at what they claim is, \"a Fraction of Competitive Cost!\"  ",
    "Great blender at a great price.",
    "This blender is perfect for those who want a higher end blender, but don't have the funds to purchase a Blendtec or Vitamix.",
    "If anyone has this blender or the Vitamix and can give me some suggestions I would appreciate it, because I don't think I will be returning it because the shipping would cost too much money.  ",
    "We didn't want to fork over $500+ for a vitamix but wanted something better than the ninja...this was in the middle range.",
    "I was very close to buying a Vitamix for $500 from Costco but decided to do more research first and am very glad I found the Versa!",
    "I'm waiting to hear back from Oster on having it fixed under warranty but if I could do it again I would have just spent the extra and got a Vitamix.  ",
    "Frankly, I loved the VitaMix, too, but gosh - I think the Versa looks A LOT sexier and it appears to work equally well in my experience so far, for less cash.",
    "This is a great blender for the price.",
    "My wife was so happy that I didn't lose my head and fork out $450 to $650 for a blender when this Oster, which cost around $235 dollars can do the same job they do.",
    "It is of course far from the cheapest blender you can buy, but it's very nearly as good as most of the $500-$1000 blenders out there.",
    "If your budget doesn't allow for a high end blender, then I'd definitely get this cheaper blender.",
    "I highly recommend this blender because of the previous reasons and its price: very affordable.",
    "It is an excellent blender, and at the price point, very hard to beat.",
    "the other blender would probably do very well for you and save you quite a bit of money.",
    "Also, the other, cheaper blender started to smell \"hot\" after a few minutes of blending, this one did just fine with 5 minutes on high speed."
  ],
  "12673":[
    "At first I didn't believe that just by using this tool to match the exact tension for each lug on my drums would really make that big of a difference.  ",
    "I use the Drumdial here, making sure my starting point has even tension.  ",
    "Drummers use these for tuning the heads on their drums, to be certain of equal tension around the drumhead.  ",
    "I was able to check all of my drums tuning to find that I was very close to the right tensions before I got the Drumdial.",
    "It's not really \"measuring\" tension but it's measuring the distance between the drum head and the indicator pin as intended and with the scales in the included tuning chart this thing is incredible.",
    "I used this to set the head tension on my banjos, and each one I used it on, I was able to find and repeat the perfect tension adjustment for maximum tone quality.",
    "I used theDrumdial Drum Tunerto check the tension on my banjo head.",
    "It is also good for  making a measurement of that &#34; perfectly tuned\/pitched drum&#34; and either keeping it there or reproducing it when you change heads.",
    "The Drumdial is an excellent instrument in detecting flaws as well as measuring tympanic tension at the lugs.  ",
    "It is extremely accurate at measuring drum head tension at any point on the drum head.",
    "-- You place the tuner near the lugs, and adjust the lugs, and the dial measures the tension of the head.",
    "-- It also lists what tension you should use according to what type of drum head you're using on your snare; ie, coated, etc.Quality:",
    "Then you get in the ballpark and use the drumdial to make everything precise.  ",
    "More accurate than using a torque wrench on the tuning lugs, it's simple and straightforward to use.  ",
    "A precision made instrument that takes the guesswork out of drum tuning.",
    "If you want to accurately tune your drums you need this.",
    "This will give you the most accurate tuning on your entire drum set without ever having to strike the drum to check for tuning.",
    "I highly recommend this purchase if you are frustrated with the sound of your drums, or if you're not but you are picky about tuning to the same exact pitch every time.",
    "Again, if you've ever struggled to make your drums \"sound right\" or been frustrated by the whole drum tuning experience, get the drum dial.  ",
    "I have always struggled to get my drums tuned consistently.",
    "I've owned this drumdial for about 4 or 5 years now (though I purchased mine at Guitar Center), and it saves me a lot of time tuning my drums.",
    "The DrumDial takes the guess work out of tuning your drums.",
    "I bought the Drumdial to help speed up the tuning process which can be a lengthy if left to one's own devices.  ",
    "It can get pretty frustrating otherwise, trying to get a drum head tuned such that it produces close to the same tone near each lug.  ",
    "If you've ever been frustrated with your drum tuning, the drum dial is for you!  ",
    "I was always frustrated with the sound of my floor\/hanging toms.",
    "Makes changing heads really fast and easy as I can go straight to my preferred tension setting without doubting its pitch and messing around with tuning",
    "I've been playing for about 16 years and I'm OK at tuning but this makes it way easier, especially when trying to find the 1 lug that's out of tune a little and giving the drum a nasty overtone.",
    "I replace the heads and re-tuned a 5 piece kit in less than an hour with the drum dial and I know that I can repeat this process and get the same tone each time.",
    "Initially I had been tuning my resonant heads higher than my batters to kill some sustain",
    "The attack is now very crisp, the ring is just enough to provide the distinct tone I'm looking for, and the sympathetic snare buzz from the toms was instantly reduced.",
    "This little device allows me to quickly and consistently tune my drums.",
    "I would recommend this for anyone who does recording or wants to reproduce the same sound again and again.  ",
    "But I can't seem to get it to work consistently.",
    "Once you find a tension that works, you can repeat it.",
    "It will save a ton of time; besides, Drumdial guarantees reproducibility of the same sound\/tension each time you change heads.",
    "Even if you are not good at drum tuning, following the chart and tuning to the suggested tensions will give you excellent results every time.",
    "So, if you are kinda a newbie doing the internet lesson thing like me, I would highly recommend this.",
    "I strongly recommend getting this device for both new and old heads.",
    "I recommend to drummers of all experience levels and styles.",
    "It is a great tool if you are a new  drummer or been playing for ever, Wish I would have bought it along time ago",
    "Even the experienced drummer, accustomed to tuning his drums, needs the drumdial.",
    "If you are new to tuning drums like me this is what you need.  "
  ],
  "17938":[
    "Also, if you are using condenser mics only the number 5 and 6 tracks have inputs with phantom power.",
    "It even has phantom power on two of the inputs so I can use my condenser microphone.  ",
    "I plugged in AKG Mic. to phantom input and Zoom 16 pick up very week.  ",
    "Not a deal-breaker, but another pair of phantom power inputs would have been nice.",
    "For any kinds of live recording.  Has built in mixer, 8 inputs with 2 channel of Phantom power as well.",
    "I think the only way you can record 8 simultaneous tracks is with some kind of preamp for each track because without that the number one track will be a normal level while the others are so low you can't even hear them.",
    "I can record 8 inputs at a time, and output 16 tracks to a stereo mixdown track.",
    "built in chromatic tuner, metronome, effects galore, record them wet, or just monitor them dry.. slave another one and you have 32 tracks... simple, intuitive, makes me actually want to record again!",
    "This recorder can record 8 tracks simultaneously.",
    "It is the only truly portable recorder I could find (for any reasonable amount of money) that will record more than two simultaneous tracks from line-level inputs.",
    "Battery-powered recorders are obviously not new, but this box is genuinely a fully-capable recording studio that achieves the magic number of 8 simultaneous inputs, with effects and mixing.",
    "Recorded 1 and 1\/2 hours using the built in Mics.  ",
    "For recording 8 inputs simultaneously this recorder fits my needs perfectly.",
    "You can even place amp sims, etc on the track output so you can record complete dry tracks and reamp them in your DAW with Amplitube, Guitar Rig, etc.  ",
    "I use six channels to record vocals & instruments, and sometimes use the two extra channels to overdub, or sometimes turn on the condenser mics to fill out the sound.",
    "Very convenient!Perhaps the best thing about this unit is that it's so easy to sit down at some studio monitors and really play around with your mix.",
    "I use it to record gigs, I just carefully adjust the gain knobs to get a good recording level, and after that I just do the normal soundcheck, hit rec and let's go!",
    "If I wanted to, I could even record several sub groups for greater mixing control.",
    "What I do know is that I've gotten to know how to squeeze out all kinds of sounds and effects and uses from this thing",
    "There's not enough preamp gain to be able to use any of my microphones."
  ],
  "12696":[
    "While it has USB connectivity (and you need that for scanning), I was able to print using Bluetooth with no problems.  ",
    "I did not experience any jams or failures to print.",
    "Print about 50 invoices a week, not one problem or glitch.",
    "This is a great EASY printer.",
    "Printer works great easy to use and transport with plenty of features.",
    "He had to go to HP's site to find out that the printer has to be installed twice to actually get the bluetooth to work.  ",
    "I had to go buy a $20 cable to get the scanning feature to work to the computer, which considering it's a $300 printer was annoying.",
    "The unit we received sucks - we are returning it ASAP.- Jams constantly (it took 25 minutes and 6 jams to print a 3-page document)-",
    "It was such a hassle to go to the hotel print and then either return to the location or mail the results or certificates of training.",
    "Printer often thinks it's \"offline\" even when turned on (took 5 attempts to restart)- The scanner function is terrible.",
    "I had trouble getting it set up to communicate blue tooth.",
    "I do have FingerPrint installed on one of my older laptops, so if I connect this to that laptop via USB, I can then print to it with my iPhone and iPad.  ",
    "You cannot print to the printer from an iPad or iPhone, despite them both being Bluetooth devices.",
    "I bought this printer to print from my iPad and iPhone.",
    "Otherwise, however, you cannot print with iPhone or iPad.  ",
    "I have a Iphone 4S and unless you have airprint which Apple does not have for the Iphone mentiond you cannot print by bluetooth.",
    "The Bluetooth is not compatible with iPhones or iPads.",
    "Flash drives can be plugged in and printed, which is another great use, so you could even print places you didn't have a computer!  ",
    "I WILL ALSO WARN YOU APPLE IPHONES",
    "The printer doesn't even come with the standard USB cord to connect it to your laptop, so if you don't have Bluetooth, you can't use this device-",
    "Compact and work great with a USB cable attached, but I cannot get the printer to print in  wireless mode.",
    "There is no wireless capability, so if your laptop doesn't have a Bluetooth, you won't be able to print wiressly-",
    "I often didn't have a printer available to me, nor did I have a power outlet.  ",
    "The Bluetooth is a joke and creates many connectivity issues, and will not allow you to scan without a direct cord connection.",
    "My laptop doesn't have Bluetooth",
    "you cannot scan to the computer over wireless AND the printer doesn't include a USB.  ",
    "The printer hangs up quite regularly (meaning it stops printing or it just doesn't respond)Again for the price ($300!)",
    "I'm pretty tech savvy but couldn't get this printer to connect\/pare to either.",
    "The printer is blue-tooth compatible, but only with computers with Bluetooth--he wasn't able to get it to work with other Bluetooth devices like his Windows phone, but that could possibly be user error.  ",
    "The HP Office Jet 150 is a portable, Bluetooth, inkjet, all-in-one printer.",
    "I couldn't get the machine to be recognized thru Bluetooth on my iPhone.  ",
    "cord- I got this primarily to use at dog adoption events, and was able to print contracts from my phone to the unit also very easily.",
    "Then I can plug it into my laptop or Surface Pro and my scans are there.",
    "Likewise, I have searched for an app that would allow me to print from the iPhone\/iPad, but HP doesn't appear to have one.",
    "But what good does mobility do if you can't use the printer?",
    "But you can't print yet, you need an app.4.You can't use the samsung print app, it only allows samsung printers.  ",
    "The printer is not AirPlay compatible, which for a portable wireless printer is kinds' inexcusable.  ",
    "AirPrint, which would be an obvious choice for an OSX-compatible printer, is not available.",
    "I tried downloading the latest version of the utility, but still had no auto-duplex printing option."
  ],
  "9516":[
    "They work great and last a good long while with normal use.",
    "While I could save up to a third off, they seem to last only half as long.  ",
    "they work real good and last a long time.",
    "They don't necessarily last as long or longer4.",
    "One pack of HP940XL cartridges lasts about a year in our house, give or take.",
    "Came in conjunction with order of HP8500. expect to last a long time.",
    "Regardless, the cartridge is rendered useless in a very short time period.",
    "High quality ink of course and the xl's last a good length of time.",
    "By ordering the 4-pack of extra-large print cartridges - one in each color used by your printer - you can forget about running out of ink for quite a while,  and your copies will have brilliant, realistic color.",
    "I bought the XL for longer print use.  ",
    "i get extended use out of them and obviously save money."
  ],
  "21336":[
    "It took a bit of work, since the snow was so hard & the driveway is slightly uphill, but it did the job faster & easier than hand shoveling.",
    "Even if it only lasts a year, it will be cheaper than hiring a service to clear my driveway and sidewalks.",
    "And since I am sick and tired of shoveling my 30 foot driveway, I figured a smaller electric snowblower would be perfect for my needs.  ",
    "Bought the snow joe in the hopes it would keep me from having to shovel.",
    "In following passes, I got so sick and tired of the machine from then on I ended up putting the snow blower back in the garage and used the shovel instead.",
    "If you live in a climate without a lot of snow or have a small driveway and walk this item is perfect.",
    "I have a long driveway and when the SnowJoe arrived, we had a good 10-11 inches of snow which was  a mix of powder and damp, good-packing snow.",
    "If you have a small driveway and don't get a lot of wet snow, this machine is great.  ",
    "only work for &#34;selective&#34; kind of snow, if it is a powder snow, it wouldn't work as it is too heavy",
    "You may have to clean the chute out if it is heavy snow.",
    "Works best in dryer snow, but works good in wet snow also.",
    "We got 6-8 inches of snow the next weekend, so I put this to work.  ",
    "Very good shipping Buick fast getting it to me well needed had 12 inch snow and ice let me tell you it works great",
    "Used it once so far and it did a nice job on a little less than 10 inches of fairly heavy, wet snow.  ",
    "This was used on a 6&#34; deep snow here in Missouri and worked very well.",
    "This snow thrower works very well, even on heavy snow.",
    "This may work for light powdery snow but anything with more moisture it will not work.",
    "This is roughly $200 - do yourself a favor and pick up a gas powered one which will handle much heavy duty snow along with the light duty one as well.",
    "This is really ideal for lighter and infrequent snow--it doesn't skip a beat when there's maybe six inches or less accumulation and it's fresh, powdery snow.",
    "This electric snow blower is light weight and able to discarge up to 5 inches of soft snow.  ",
    "This did well for the most part but it did struggle with heavy-wet snow.",
    "The snow discharge chute did not jam with snow, though pre-spraying the chute with WD-40 or a silicone lubricant is advised.",
    "Ready to go right out of the box, and worked well in up to 8 inches of snow.",
    "Pros &#8211; cuts through snow w\/o a problem, really throws the snow, easy to start & maneuver, lightweight, etc&#8230;  Cons &#8211; the cord gets in the way.  ",
    "It's powerful enough for 8+ inches of powderly snow, throws it a good distance away, easy to use, easy to manuever, light-weight enough for my petite wife to use, and it fit my budget.",
    "It really throws light snow and all the pine needles underneath.",
    "If the snow is powder and as high as maybe 7-8 inches, this little machine does a very good job of clearing it.",
    "I tried to use this on 8\" of heavy snow and it was useless.",
    "I received the Sno Joe within a few days, very well packed and easy to assemble, I was able to use this on a light fluffy snow, I was very impressed ,it through the snow a good distance  , this is a light weight medium duty unit.",
    "I got the 15-amp Snow Joe to replace a gas-powered snowmower and it is just perfect for the 4-6\" of snow we typically get in Cincinnati.",
    "I don't expect too much from this blower as it is electric and it is only good for up to 10\" of snow, so I won't sell my snow shovels as they will still be needed.",
    "I couldn't just plow through it because the snow was so wet, but i was able to clear it all by doing little bits at a time.  ",
    "By the way I live on Long Island in NY.UPDATE 2-6-14How does it work on very heavy, wet icy snow?",
    "As for the Snow Joe SJ623E, This little power house blasted through ten inches of fresh snow as if it was a hot knife slicing through  butter.  ",
    "A few days later, a polar vortex dropped 8&#34; of snow on SWPA so I put this unit to the test.  ",
    "The first time I used it, there was about 14 inches of snow.  ",
    "However, the second time I tried using it, there was only about 6 inches of snow, but combined slushy snow on the bottom with powdery snow on top.  ",
    "Its throwing snow very well, and after 45 minutes of use, I do smell burning plastic but its faint.",
    "It works surprisingly well on really deep snow, needing just a back and forth to power through 2 feet.",
    "I used this thing for 3 months in Minneapolis that experienced decent snow this year plus record lows which would make the snow stick around.",
    "The Snow Joe is an effective snow blower.  ",
    "With this 2013-2014 winter i put this blower to the test and it has worked even in snow twice as tall is itself.",
    "I've even used it in 2 inches of horrible slush\/rain\/snow which I wanted to clear before it froze over night.",
    "If the snow wasn't too deep, that Toro did the job.",
    "I recommend using some silicone spray down the chute and blades for wet snow.",
    "We received our snow blower on 2\/4 and woke up on 2\/5 to eight inches of snow in our drive.  ",
    "The good is that it is easy to maneuver, the bad is that being so light if you keep the back wheels on the ground you will not get all the snow off the driveway.  ",
    "The Snow Joe is a bit heavy, but easy to drive and tracks straight so you don't have to wrestle with it.",
    "I haven't had to use this snow thrower yet, but it was very easy to assemble right out of the box.  ",
    "He says it is easy to move around and throws the snow out of his way.",
    "And it was light enough that you could lift it and move the snow in 2 passes.",
    "Also I had to \"nudge\" it harder a few times to get through the packed ridge left by city plows at the end of my driveway.",
    "it holds up well with 2-6 inches, but over that with a heavy snow and it takes a little bit of work.  ",
    "if snow is around 10 inches there is no problem, once you start hitting 12 to 15 inches, it stuck and you need to do real hard work to get it going.3.",
    "Obviously, I had to move the blower back and forth so that it would not stall in the deep ice laden snow, but it did not stall once nor did it jam.",
    "It was slow going since the snow was so deep.",
    "When the snow gets more like 12&#34;, the impeller begins to bog down after about 4 feet, and I need to pull the unit back a couple of feet to clear it, then push ahead again.",
    "so the snow became heavy.",
    "its a great unit for medium duty jobs doesnot handle heavy or wet snow but its nice to just grab it and go nice idea now if they could make it where it could handle the heavy stuff and no cord it would be perfect",
    "and if the snow is heavy, it might just use all of the 15amps, and it won't be any fun if you run out of \"gas\" and you will have to reset the circuit breaker or change the fuse.  ",
    "You aren't going to go out and do 10 inches of snow with this thing.",
    "We got some pretty impressive snows, last winter, up to 26 inches at a time of wet and heavy snow.  ",
    "The snow was very wet, but this little guy was up to the task.  ",
    "The SnowJoe doesn't handle wet slush nearly as good as dry snow, but it still did the job.",
    "Pretty powerful machine for an electric snow blower.  Worked even In our last blizzard, when snow was wet and heavy, required a lot of pushing, though.",
    "Now, the snow wasn't too heavy, and I'll have to see how it handles a heavy storm, but this thing kicked a**.",
    "I'm not in fabulous shape and I seriously worried about my heart as I shoveled hundreds of pounds of wet, heavy snow.",
    "I think it works well, BUT if you have heavy\/Wet snow you are in trouble.  ",
    "It went through at regular walking speed; even faster in some places but needed just a little harder push and patience at the very end where the city snowplows piled it up, but no problem.",
    "After five-six inches fell I went out there and the Snow Joe did a fine job, albeit I had to go slow.",
    "The lighter the snow the farther it through.",
    "It's really lightweight so make sure, you don't let snow pile up more than 3-4 inches.",
    "By the time it was time to drive out next day it had snowed another few inches but that just required a very light snow throw finishing touch, primarily to make tire tracks (I could have driven out no problem",
    "I've only used it once, with about a 1 1\/2\" damp snowfall, but it moved along great and blew the snow with ease.  "
  ],
  "14980":[
    "Our water pressure isn't the best in the world and this little guy brings more power to the hose.",
    "It will deliver a fine stream of water depending on your water pressure you will not be disappointed.",
    "Can shut water off with twist of nozzle or deliver a powerful jet of water that can reach my eaves and upper windows.",
    "It does not give 50% more force as advertised.",
    "It was advertised as having 50% more force than ordinary nozzles.  ",
    "It takes even low water perssure and creates a strong stream when you want it to.",
    "It really works well and you can change the force of the water.",
    "This little guy really amps up the pressure coming out of the hose.  ",
    "I was hoping this would generate a narrow stream with a lot of power.",
    "The village I live in told me the water pressure is between 45 - 50 psi.",
    "I liked it a lot as I have low pressure, my water system runs off a well.",
    "I have a well for household water which does not have great pressure.",
    "Have so-so water pressure, so this is the main reason I got this.  ",
    "This nozzle gets back some of that lost pressure, I would recommend it .",
    "Works great and helps with low water pressure by concentrating the stream.  ",
    "This won't take your skin off, but for cleaning my bird's cage on a well system this increases the water pressure enough to make the job quick.",
    "It does a good job of providing a strong stream under lower water pressure conditions...but it is no replacement for your pressure washer.",
    "It also doesn't magically increase your water pressure or flow rate.",
    "Don't waste your money unless you have municipal water with decent pressure.",
    "I purchased  it for one of those spiral hoses that are notorious for reducing pressure as the circumference of the hose is small.",
    "Works very good under normal or low pressure.",
    "If you adjust it to the finest amount it comes out like a hairline stream, but with very little pressure it is absolutely pointless to ever use it on this setting unless you're really aiming to clean a smalllll tiny area of LOOSE material.",
    "Tried using it to low pressures water, water pump from well tank, it was patethic.",
    "Most cities regulate the pressure to about 30 psi.",
    "I attached the nozzle to a hose with 55 psi water pressure with outstanding results, my other hose has an unregulated water pressure of 180 psi.  ",
    "The Bulls Eye is high quality and it produces higher water pressure than my brass adjustable nozzle.",
    "The stream of water is precise and powerful.",
    "I use the extra fine stream often, a feature most nozzles do not have.",
    "It has exactly the same water pressure as any other nozzle.",
    "That's good water pressure.",
    "It had a tiny pinpoint stream of water that came out at high pressure and there really isn't a use for that kind of stream.",
    "Honestly I wasn't expecting too much when I bought this as it was still going to be only pressure from the garden hose, however, this thing worked great.  ",
    "The claims that it provides more water is due to its design that does not constrict the flow of water out of the hose.  ",
    "When you tighten the nozzle, it will squeeze the gasket making it small and giving you a narrow stream and vice versa.  ",
    "I have 70 PSI of water pressure and it does work great.  "
  ],
  "12864":[
    "It has also helped alleviate stress associated with rain and storms....",
    "I have tried DAP plug-in, rescue remedy, thunder shirt, etc to help my coonhound's separation anxiety.",
    "If I anticipate extra stress (lots of house guests) etc.",
    "I was just giving him Composure chews at first but the 2 products combined seem to work very well for my dog, and extra chews can safely be given in increased stress situations.",
    "She was nervous about many things, men being one of the main stress points.  ",
    "They do not knock him out or make him drowsy,they just help him deal with his anxiety and keep him from wigging out over every little noise or startling activity.  ",
    "Seems to help with overall nervousness without impairing thinking.thank you for very prompt delivery.particularly helpful in rally class with 12 other dogs.",
    "Our trainer thought this might help calm his nerves a bit and make training easier.  ",
    "It did help her with seperation anxiety.",
    "I wasn't expecting a miracle but I was definitely looking for something to help with my dog's anxiety.",
    "I ordered Virbac Anxitane hoping it would help him get past the moments of anxiety.  ",
    "Tilly loves how this product keeps her less stressed, and her mom (me) loves that it's cheaper here than at the vet!",
    "This product was recommended by my vet for an internally nervous cat (appeared very calm on the outside) who was having litterbox accidents.",
    "My dog is very attached to me and gets very anxious when I leave him but Anxitane works awesome!I tried another product - a collar with pheromones that was supposed to provide the same affect as Anxitane and I can tell you the collar did absolutely nothing for my dog.",
    "I would absolutely recommend this product to anyone that has a dog that suffers from anxiety.",
    "(Also search for Theanine on AnimalPlanet.com for more information.)I rated this product solely for its effect on my 14-year old dog, who suffers from night-time anxiety due to early cognitive dysfunction (senior dog dementia).",
    "I was so frustrated because I have been dealing with this for 5 years now and have tried just about EVERYTHING- including vet prescribed anxiety meds (that did not help at all!)",
    "I gave my dog the dosage indicated, starting about 12 hours prior to the predicted thunderstorm and it really did seem to help her stay more calm during the storm.  ",
    "Have used this product for about a year now and it has really worked in aiding in the training of my anxious dog.  ",
    "Our dog shook at thunder, fireworks and gun shoots.  ",
    "Our 110 lb Bernese Mountain Dog is afraid of thunder and fireworks and requires constant attention when they occur.",
    "My dog was easily upset by noises such as thunder and fireworks.",
    "Also, this particular product may not be the right solution for my dog's fearfulness.  ",
    "Our family adopted a dog from a humane society and she had a tough time adapting to our new home - when we were gone she slammed into our door, clawed on our walls, paced, didn't eat, and other symptoms of stress.  ",
    "It may also be that only time will help him get past the final 15% of fear triggers."
  ],
  "17439":[
    "My husky loves the blue Buffalo wilderness in duck flavor.",
    "He loved the Wilderness Duck Soft Food, which I was mixing with the Merrick, so I decided to give the dry food a try.  ",
    "I've always tried to feed my dog the best food I could find, and I'm impressed with Blue Wilderness...and most importantly, my dogs love it!  ",
    "Some people claim their dog \"loves\" the food, however, it is made with flavor enhancers for that purpose.",
    "Blue wilderness has too many veggies for our pooch.",
    "We tried this Wilderness dog food in the dry form and he loved it!",
    "My dog is so addicted to the Wilderness food that he will find every last piece of kibble that he scattered on the floor, and gobbles it up.",
    "My Boxer likes this brand a lot, especially the Duck flavor.",
    "we played fetch for hours.i've tried every formulation of the wilderness (bison, chicken, salmon, duck,) and my bulldog definitely favors the duck.",
    "So far, this is the first dog food that hes been absolutely fine with and cant wait to eat!I wish they came in a larger bag and wasn't so darn expensive, but you get what you pay for",
    "We were worried about boredom with this diet as he seldom likes dry food but we have no trouble getting him to eat both the chicken and the duck varieties.",
    "Blue Buffalo Wilderness is like candy for my dog, but is the most healthy by far at the same time.",
    "I love all of blue buffalo wilderness formulas as I have cats and dogs and they all love it and are thriving.  ",
    "We have had no problems with feeding since we switched to Blue Buffalo and the dogs love the flavor.",
    "This is great dog food.",
    "This is great dog food that my dogs like, but it gives them very smelly gas.  ",
    "Never before have they really liked a dry dog food but this one is a winner.",
    "Blue buffalo is a WONDERFUL dog food.  ",
    "My dogs really never loved or even liked most of these foods, and generally wouldn't start eating the food when the bowl was put on the floor unless I poured some low sodium chicken broth on the food.",
    "I haven't told my dogs that this food is healthier than what I had been feeding them, and they LOVE it.  ",
    "I have 2 boxers that LOVE this food and they are picky eaters.  ",
    "My dog LOVES this food.",
    "Great dog food.  ",
    "As well as all the dogs that I pet sit (although I'd prefer they eat the food that came with them!).  ",
    "We tried several different grain free brands and they're all fine, but the Wilderness is the brand that even my cats try to steal because they love it.",
    "No matter which BB Wilderness variety we purchase, our three older dogs (ages 8, 13, 14) benefit from its superior nutrition.",
    "my dog loves it.  ",
    "The ingredients are natural and my dog loves it.  ",
    "It was recommended by our kennel and my dog devours it.",
    "It seems to have good nutritional ingredients, and my dog likes it really well",
    "My pup loves this food.",
    "My little papillon loves his food and has no problems!",
    "My dogs love this food.  ",
    "It is great food for my doggie and he loves it!",
    "Hell, even my cats prefer it to their own kibble food.",
    "He loves the food, and gobbles all up every feeding.  ",
    "Our Weim loves this food.  ",
    "This is my dog's favorite food.",
    "My other dog gets this mainly because she just prefers it to the cheaper dog food I was accustomed to buying.",
    "Usually buy the salmon from Blue Wilderness, but I thought my puppy would like to switch things up.",
    "Note that some dogs don't like Blue Buffalo kibble, so you should buy a small pack first to see if your dogs will eat it.",
    "But my little Shiba Inu didn't like the duck.",
    "He doesn't love it, as others' dogs have, so I've been mixing it with lean ground beef and I'm trying to gradually decrease the amount of beef each day 'til he's used to it.",
    "My dog doesn't really like the salmon flavored one.",
    "One dog liked it and the other didn't care for it much.  ",
    "I have two picky and spoiled dogs.  ",
    "I had my dog on Merrick Grain Free Duck, which has the same level of protein as the Wilderness Duck.  ",
    "High in protein, and my dog hasn't had any illnesses from this dog food.",
    "The only thing is that the protein content is VERY high, so if your dog is a couch potato and doesn't go on walks or exercise..",
    "I decided against Orijen as the product is produced in Canada (USA product patron) and the protein is unnecessarily high in my opinion.",
    "While it definitely is grain free & has a much higher protein content than most dog foods - I am a little disappointed at the fact that there are no bags larger than 24lb, and the price seems to continually increase.  ",
    "A well-known and well-respected breeder said that BB Wilderness Duck was the answer - that it had more kcal\/cup and would pack the weight on safely.",
    "Their canned Wilderness\/ grain free foods also follow suit, and I do tend to find that they have a higher fat content than some other brands out there - that I am actually in the process of switching to.  ",
    "After learning that digestional issues can be caused by grains and fillers used in many dog food formulas, I decided to give Wilderness a chance.",
    "I was transitioning the food slowly and by day three ALL of them had liquid explosive diarrhea.",
    "I have a dog with a very sensitive stomach and this food is the only one I have found that does not upset her stomach.  Was delivered very quickly at a good price.",
    "ALL 4 cats had have random bouts of vomiting, ALL 4 cats have been going bald all over.  ",
    "I have 2 larger dogs - a Std Poodle\/ Service Dog and a Wolf-Hybrid, who both have more sensitive stomachs...",
    "This food gave my dog horrid gas...",
    "The breeder recommended Innova brand dog food, but our youngest kept vomiting after she ate it.  ",
    "Before getting this dog food my terrier, would often vomit much of her food.",
    "I bought this food for my akita but it keeps giving him diarrhea, I wanted to get the best food for him",
    "So even with the small proportion of Wilderness that was mixed into the Merrick, he got diarrhea.  ",
    "We got through the bad and figured that lot or set of ingredients didn't agree with their digestive systems so we went over to the Duck.",
    "and you will find many complaints about this and other sicknesses.",
    "but it made my dog really gassy and he did not like it.",
    "Unfortunately, even after switching brands gradually, our dog continues to have abnormally soft stools.  ",
    "I recently started fostering a pit bull and was given Science Diet for sensitive stomach formula since she had stomach issues.  ",
    "One dog eats it okay, but it makes the other dog sick even.  ",
    "Unfortunately this food causes a gas problem he did not have before.",
    "This food, however, has turned her into a a diarrhea fountain.",
    "One of my dogs has a very sensitive stomach and a couple food allergies.",
    "I thought the high protein content would be an issue for my dog based on issues with other high protein foods, but that is not the case with the Blue Buffalo Wilderness.",
    "No doubt about the weight - I never had any issues with diarrhea and have fed this little guy BB Wilderness Duck for two years now, He weighs just over 75 lbs now - still a tad thin, but he's young so I'm not worrying about it.",
    "It is not advertised as an allergy free dog food, but it definitely is due to the fact there are ZERO grains.",
    "I tried every food that said it was for skin problems or allergies,nothing did any good...then I saw this and decided to give it a try,after 2 weeks her hair is growing back in,she isn't chewing or scratching all the time...",
    "I thought we'd start with food first, since the other four dogs don't have any problems and they're all on ProPlan.",
    "This diet in particular is grain-free, with no wheat or soy, which was great for my allergy dog.  ",
    "His stomach and allergies have become a non-issue since changing to this food.",
    "I was a little hesitant given the high cost - but am very glad I made the switch.",
    "This food has proved to be worth the high price for us!",
    "Many of the foods that cost as much as this or close are also rated 1-2 stars.",
    "It would cost me about 500.00 each time and their skin would only get slightly better.",
    "the Orijen is probably the best dry dog food you can get BUT its $70-90 a bag and very hard to find locally ..",
    "It is truly top quality dog food that is the next best thing to making your own dog food which will cost even more.",
    "As Expensive as dog food gets (Over $2 lb).",
    "the Wellness Core is also a great food... slighty more $ than the Blue .. I went with this stuff since it's always in stock at PETCO, is usually on sale ($55) & the lifesource bits really do matter.  ",
    "its also about $10.00 cheaper than any place I can find the same food in Alaska, Great product",
    "This is more expensive than just the regular run of the mill dog food, but it is well worth it for one of my dogs.",
    "More expensive than some dog foods, but it is totally worth it.",
    "Its one of the more expensive dog foods out there.",
    "However, the price is probably justified unlike any of the other expensive , but not necessarily good quality dog foods.",
    "The only two negatives I have are price and not being able to get this stuff in larger bags for bulk ordering.",
    "I know this product looks expensive.",
    "you get what you pay for, and even though this stuff is expensive, it's great food.  ",
    "With other foods that cost as much as this food, he has never looked forward to eating, and never had a proper stool.",
    "No issues with the quality of the product or Amazon getting it to me, although this food is pricey.",
    "DRY is the least preferred for food, but dehydrated raw and \"Human grade\" are just too expensive.",
    "An expensive waste of food & money.  ",
    "Got much higher rating than the prescription dry food that we were getting from the vet at $60 for an 18 pound bag.  "
  ],
  "1693":[
    "Protection for my Barnett Quad 400 is what I was looking for while traveling in a truck and UTV.  ",
    "As per reviews I read , it is bulky, but great protection for my Barnett Quad 400 crossbow.",
    "Really protects my quad 400.  ",
    "I like the molded plastic case because of the protection it gives the bow, yet it isn't too heavy.  ",
    "but once you complete cutting pices of foam to curve to your crossbow shape it will give a really good protection.",
    "It has a good amount of protective foam.",
    "Great bow case, very good quality, my RTD Scorpyd is well protected in this case plus you have plenty of extra storage.",
    "Good protection.",
    "With the straps provided, It holds your crossbow solid without moving around and provides good protecting while in the back of your UTV.",
    "I like the case because it was easy to assemble and it affords great protection for the crossbow and scope.  ",
    "Has plenty of space inside and the four hinges make it a tight fit.  ",
    "instructions are dark and hard to figure out,but after a short time i got it.needs more straps inside and takes up a lot of trunk room,but fits on front of my quad .",
    "i have a barnett ghost 350 (witch isnt a small crossbow) and i cant imagine any one having to need this much room.i guess if your crossbow is so big you need this case but if you do have a crossbow that you need a case",
    "On the good side, there is plenty of room to store everything in the case - arrows, extra arrows, quiver, wax\/grease, allen wrench set, carrying strap, and more.",
    "I have trouble fitting this case in the cab of my truck.",
    "Even though it is bulky, I wanted to have a hard case to store my crossbow.  ",
    "Brought this for my strykezone 350 and its plenty big enough to hold my bow and everything else I need to fit.",
    "It only has a storage spot for 4-6 bolts I think so I got an external MTM bolt case.  ",
    "As I need a large case to house my Excalibur Equinox, the size is a necessary evil for me.",
    "This is a great crossbow case, and the only one that I could find for my Barnett Quad 400.",
    "I like the mantis because it is big enough for the crossbow with the scope still on ,quiver ,and extra bolts.",
    "He has a Barnett Quad 400 and this is the only hard case I could find to fit it.  ",
    "This case is the only case I could find to fit my Barnett Quad 400 AVI.  ",
    "This is the only hard case I have found that fits the barnett quad 400 without making changes to the case or removing the scope.",
    "Most of the other models would not fit my crossbow but with it's adjustable case extension it made a perfect fit for my Barnett Quad 400 Crossbow.",
    "Perfect fit for Barnett Quad 400 crossbow.  ",
    "There is some assembly required that allows it to be adjusted for different length crossbows and the width fit my Quad 400 with an inch or more to spare, plenty of room to protect the cams.  ",
    "The top that closes over the scope likewise easily fits over the Barnett 3x illuminated on it.",
    "I would recommend this case for someone needing good protection, however it is a little large for field use.  ",
    "Very functional with good design to keep crossbow protected and include key accessories like bolts, string and such.",
    "So I would have to say this is the case to buy to protect your crossbow!",
    "I would recommend this case for anyone looking to protect their investment.  ",
    "I like the tie down straps that keep it safely in place.  ",
    "I have no doubt that it will protect my investment well for many years!!!",
    "I had a soft case but it really didn't protect my crossbow in the bed of my truck, so I purchased this hard case and I am glad I did.  ",
    "I am very pleased with the level of protection it provides my high dollar investment.",
    "By goodies, I mean arrow holders and straps to keep things from sliding or rattling around inside.  ",
    "Even though the size is big, I am very confident that my crossbow is well protected.",
    "I bought a Plano Pillar- Lock &#34;Compound case&#34; and modified it's interior by adding &#34;tie-downs&#34; and straps.",
    "My manta case was missing the two bolts for the extention.",
    "Great item for my Barnett Penetrator Crossbow.  Could have included more tie down straps for accessories.  ",
    "Finally, Plano should have more foam where the stock is secured.  ",
    "Once I made sense of things, I added foam padding in several areas, added my own straps (modified the included straps).",
    "I bought 3\/4 in velcro tape from a big box store and some 1\/2 in screws to hold the plastic boxes down as the case only has two extra straps.",
    "I had to add some additional foam before I was truly satisfied that my equipment was stable enough to survive life within the case, but it does a passable job.",
    "Even if my crossbow fit, if I cinched the straps at the stock down, the stock would not be snug up against foam."
  ],
  "2998":[
    "I love to punch the old punching bag, and I am always tearing up my knuckles to the point that they are bleeding.",
    "Before getting into this review, some background information is relevant:-I've been doing endurance heavy bag workouts for about 4 months now after deciding to try to get back into the fighting shape of my youth, and I've tried a number of different wraps and light gloves while doing so.-I usually hit the bag for an hour to ninety minutes, 4 to 5 days a week, and I needed something that was heavy enough to prevent severe knuckle damage while light enough to still allow scarring and calcification of the knuckles, as I don't see much point in building arm definition if you split your knuckles on the first punch in a real scrape.-I started out with old muay thai 108\" wraps, but found they were FAR too light, and tore knuckles within the first week of bag work.  ",
    "But as we did bag work I found out that they still cause scrapping along my middle and pinky knuckle.  ",
    "If you use these for working on a heavy bag, you will have very raw fingers in a hurry.",
    "I still use ungelled mexican wraps once a week to get some extra knuckle scarring, but every other day of the week, I'm strapping on Title Platinums.  ",
    "i find myself with my hands (fingers and wrists) hurting when using with a heavy bag (and 16 oz gloves).  ",
    "And despite all of the protection, they still are light enough to result in minor knuckle scarring and calcification, albeit only if you're hitting the bag for an unusual length of time a week.",
    "Seemed ok at first, but after about 5-6 hrs, I started to have serious pain in my right hand.",
    "I purchased these to ensure I didn't cause more damage.",
    "I have messed up my knuckles on dozens of occasions to a point where I am bruised completly.",
    "I have a few cuts on my knuckles and never have used wraps before but continuely getting them opened up I decided to give it a try.  ",
    "I have a cut on my middle knuckle that I've had to nurse with my traditional wraps.",
    "After 3-4 uses I ended up with skinned fingers and busted knuckles.",
    "Unfortunately I had pain in my thumbs from both brands of this style so went back to my old wraps and now I am pain free.",
    "I use these to hit a speed bag and as wraps under bag gloves for hitting a heavy bag.  ",
    "I was looking for a wristwrap solution that would work under MMA bag gloves, as regular handwraps were time-consuming and a tight fit.",
    "just got these today first time using glove handwraps and I love these things, they fit perfectly under my gloves for competition and provide top notch wrist support",
    "Use these with the proper heavy bag gloves and you can't go wrong.",
    "Always use the hand wraps\/bag gloves combo",
    "I asked twice, specifically, if they would fit under their MMA gloves (which I already use).",
    "This work well for wraps under my boxing gloves.",
    "They may look like MMA gloves but they are called wraps for a reason - meant to be worn under gloves when hitting a heavy bag.",
    "but I wanted them for extra padding under boxing gloves & quick way to wrap up.",
    "I was literally forced to box without them or not wear gloves.",
    "I also tried putting these on with my actual boxing gloves (how these should be used) and they don't fit.  ",
    "prosu can put it on quickconsdo not protect your fist and wrist as good as regular wrapsIt's ok if work on padsOn heavy bag it will not provide enough protection.",
    "Easy to use, quick to put on.  ",
    "I put these wraps on 3-4 times faster than regular wraps.",
    "Did I mention they are put on in a fraction of the time of the 180 inch wraps?Good quality, but the wrist strap could be stouter, however it works as advertised.  ",
    "These are padded extremely well, I love how fast\/easy they are to put on compared to regular wraps.",
    "I wanted something faster and with more knuckle cushionso I tried everlast evergel handwrap, but that had ZERO support.  ",
    "I realized that these did not offer enough support for the hand.",
    "I DO NOT recommend these; they don't stick to the knuckles as advertised, and this results in shifting during workouts and having to adjust your wraps to better hold them in place.  ",
    "Also I feel the wrap is a little short to truly protect wrists and thumb.",
    "My knuckles have not been sore since I got these.  ",
    "They would provide good knuckle protection for 30 or 40 minute a day bag workouts, but any more than that and they draw dangerously close to the same knuckle tears that came from the 108\" wraps.  ",
    "They work well for these activities, good padding and provide decent wrist stability (though not quite as good as long wraps, which I expected).I think some negative reviewers are using them without gloves for hitting a heavy bag, which is not their purpose.  ",
    "If you're not a hard puncher and\/or don't need hand support (which is crazy) and\/or only looking for wrist support, then these will work.",
    "I do not like the tedious wraps that are traditionally used and find these wraps give excellent support and protection during kickboxing.",
    "One thing I did not realize is that the gloves are integrated with about 2 1\/2 feet of wrist wrap.  ",
    "Some people think that it does not offer enough wrist support, but I disagree.  ",
    "The guys at the gym typically use traditional wraps, but I wanted more protection.  ",
    "They got minus one star for not covering the lower knuckle (even with a bit of fabric).",
    "So i will still use my everlast gel wraps to do my speedbag workout & my title gel wraps for the heavybag, they offer more protection on the heavybag than the everlast gel wraps.",
    "gloves, this still offers enough protection for anyone who wants to occasionally hit the bag.",
    "These things gave good knuckle protection at first, but they were shoddily made and they tore at the stitching within a week, with one set literally tearing the same day I bought them.  ",
    "I was looking for something light weight to protect my knuckles.  ",
    "I hope this gets fixed eventually, because the gel portion does a great job of protection and has durable stitching, which the other brands that mirror this type of wrap tend to lack.",
    "I bought these wraps to protect my knuckles during sparring sessions.",
    "I am really impressed at how well these protect my hands."
  ],
  "1708":[
    "It's certainly not high-precision, but I think we had better luck with this than a spring-loaded hand-held drill guide we tried 2 years ago.",
    "I used this with a hand drill to center some holes in 1\/2 inch PVC pipe and it works great.",
    "And you still get a bit of wobble in the drill, though it was by far much more accurate than drilling free hand.",
    "It also is superior to home-made drilling guides in that it is made of steel and will not &#34;wallow&#34; out with continued use.",
    "This won't be as accurate as a drill-press, but for us it was way better than nothing at all.  ",
    "While this is no substitute for a drill press, with lots of clamping and measuring, this product did work.  ",
    "Just make sure to use two clamps to hold the drill guide securely to the material being drilled-- I found that using one clamp wasn't enough to keep the drill guide from traveling once the drill got going.  ",
    "The V groove on the underside made for use when drilling a hole in pipe (see picture) also ensure that wood chips from the drill don't bunch up under the tool.  ",
    "If the drill guide isn't clamped down it will most likely move and throw the hole off.  ",
    "Remember that it's worthless without a clamp or two to hold it in place -- so not for walls, etc.",
    "Also great for drilling a hole in round PVC pipe, bottom V grove helps it stay in place.  ",
    "The guide holds the drill bit perfectly straight-- the holes are just the right size so that the drill bits are held snugly with absolutely no variance or wobbling.  ",
    "The major problem is the bottom is slick making holding the tool against the turning action of the bit hard; thus, the user must clamp the drill guide down to avoid problems.",
    "For many applications, I just hold the jig in place without actually clamping.",
    "Works as advertised - you can hold it in place with a hand, although clamping certainly makes it easier.  ",
    "You are only limited to using it for the drill bit sizes on the jig, and in spaces where you can securely clamp it.  ",
    "To use these drill guides the user must position the unit over the spot to drill and then clamp the drill guide down.  ",
    "Works great just what I needed you do need to use a clamp if at all possibleAnd a sharp bit.",
    "The V Drill Guide is solidly made and works well in many circumstances  The only problem I see with it is that you are supposed to clamp the guide to the work.  ",
    "This is a well-built precision tool that will ensure that your hand-held drill will be in a perpedicular position to your work piece prior to drilling.  ",
    "Be sure you use a good clamp.",
    "The drill bit contacts the sides of the holes causing the guide to move a little.  Tried it with one of the smallest bits and the bit broke because I wasn't exactly straight into the hole.  ",
    "You'll have to buy longer bits, or at least start the hole with the drill guide, then use the straight hole you just drilled to guide you when finishing the hole without the guide.",
    "Unless you hold them very tight your drill doesn't drill straight,  I'd buy something else.",
    "good quality and is a very helpful tool if you want to drill straight with your hand drill.",
    "Just like the tap guide, well made and ensures that you will drill straight holes.  ",
    "There are several \"drill press\" attachments to help make a perpendicular hole with a portable electric drill.",
    "While maybe not Space-Shuttle precise, it does VERY well, guiding the drill bit straight and square.  ",
    "This tool makes it much easier to drill perpendicular holes on flat surfaces.  ",
    "The drill went through the stack-up perpendicular to the wood and out the back in the correct position.  ",
    "It provides enough length to guide the drill bit at a true 90 degree angle.  ",
    "Purchased this to try to drill straight holes thru 4 x 4 post.",
    "It is small enough to maneuver and use in many places (and easy to hold still w\/ claimps), and once securely clamped, ensures pinpoint accuracy.",
    "One also can't see if one is right over the drill point, and the markings are too rough for precise work.",
    "Small, nicely designed, hardened steel, precise.",
    "Wow.  Very cool, very easy to use, and highly accurate.  ",
    "I clamped the jig to the dowel.  ",
    "Buy this and get a clamp in hand, problem solved.",
    "Guide worked great when C-clamped over hole locations."
  ],
  "4751":[
    "This fan is described at \"whisper quiet\".  ",
    "I think the best feature of the fan is how remarkably quiet it is whether on low or high speed.",
    "Fan has 2 settings and both are fairly quiet.  ",
    "And thankfully this is, as promised, quite a quiet fan, on the low setting that is, on the high setting it is as noisy as any other fan.",
    "This tiny (only about 8 1\/2 inch) fan makes a quiet swoosh on low, and a louder noise on high.",
    "One speed would work for someone who needs a small fan for a work space near other people because it is fairly quiet and the output isn't overwhelming.",
    "When I plugged this in, it sounds like a fan, looks like a fan, a quiet one though, nice white noise.",
    "It's quiet, yet powerful, so I stay cool without bothering co-workers with a loud fan.",
    "Very breezy without being loud.",
    "I got this to put in our 25ft Trailer to help with air circulation, our trailer does have a built in unit to push air, but it is so obnoxiously loud, It makes it hard to watch TV or sleep with it on.  ",
    "This high tech fan is small and quiet; yet extremely effective at circulating air within a small room.",
    "It's not quite as powerful as the box fan, but so much more quiet and really does move the air around.",
    "Nothing loud nothing very very powerful.",
    "It is very sturdy, has 2 settings, not too loud.",
    "This is a really nice, small (9 1\/2&#34; H X 6&#34; D X 7 1\/2&#34; W), VERY quiet (truly whisper quiet), fan with a 6' cord.",
    "This fan has a drone like &#34;hum&#34; of the motor even on low...on high it's a &#34;HUM!&#34; I don't believe anyone can sleep with that giant mosquito sound in the room."
  ],
  "6747":[
    "The problem with the lot from TLG Games is that every good point came with a caveat: 5 mythic rares were nice, but there were two duplicates out of the five.(of course this would be fine if it was some epic card, but it was duplicates of a very average card).",
    "My lot had an inredibly high amount of duplicates.",
    "I received my order on time, the commons were mixed generations, did not contact so I'm not sure about customer service,  the main drawback I found was that there was a lot of duplicates over 4 and many over 10",
    "I almost want to give it 5 stars but there are a lot of duplicates, foreign cards, and excessive amount of lands.",
    "As for the duplicates, there's going to be quite a lot of cards with duplicates.",
    "There were also only 2 nonbasic lands in the TLG Games lot(including 4 copies of the one, woo duplicate problem again).",
    "In the Untapped Games lot there was over 20 of them, including two rare ones and a few uncommons.",
    "A lot of these cards will have 8 to 12 copies each.",
    "While it was a little disheartening to see SO many duplicates, you still get a great amount of cards.",
    "Upon sorting I found the following amount of duplicates.45x Deathcurse Ogre34x Blessed Breath33x Araba Mothrider29x",
    "There were at least 10 cards that I got 20+ duplicates of.",
    "There were 15 cards that had more than 10 duplicates in the package which is a little disappointing because that's just way too many of the same card.",
    "The variety of sets was nice...but the amount of duplicates was incredible.",
    "The reason I gave this only 2 stars is because when I opened the box, the cards with the largest amount of duplicates were stacked together all in the front.",
    "The most  duplicates I received was 8 cards which didnt bug me too much.",
    "The cards were all in good shape, and I didn't see many duplicates, which is usually a problem with these card lots.",
    "Only 490 unique cards out of 1036: 53% of the package were duplicates.",
    "My highest amount of duplicates was seven, which happened with two different cards.",
    "My box however had sets from only the core sets such as Magic 2014, 2013, 2012 so on and so forth with duplicates being abundant.",
    "Lots of duplicates from Born of the Gods.",
    "I've just received my package, and as far as I'm concerned now, there aren't that many duplicates, as well as the fact that they are all in MINT or near mint condition, I LOVE it!  ",
    "I was surprised and not very satisfied with the amount of duplicates I received.  ",
    "I was kind of annoyed by the multiple duplicates (20 dredge beatles),  but it's a great way to get a collection",
    "I got a ton of duplicates, because two of the three boxes I received just had the same 60-80 common cards from Gatecrasher over and over and over again.",
    "I got a ton of duplicates and all of the cards are the most worthless you can get.",
    "I got 37 copies of a single card, 24 copies of another single card, and 13 other cards with more than 10 duplicates.",
    "I did get duplicates, but they were not bad duplicates, I did get 5 mythic rares, and 20 rares as it stated.",
    "I bought 3000 from Toad and Troll before and got only a variety of like 60 cards It was unreal the number of duplicates.",
    "However, none of the rares where duplicates, the Mythics were great, and I got perhaps 200 uncommons with only a few of those being duplicates.",
    "However my brothers box had a huge range of sets and only a few duplicates up to seven was his most duplicated card.",
    "He had about a 30% duplicate rate with his current cards, and some Rare duplicates, but no Mythic Rare duplicates, so he was very happy.",
    "Had multiple duplicates ranging from 10-30 of the same card, heavily focused on a few particular sets, and the rares were complete garbage.",
    "For comparison, the most duplicates I received from Untapped Games were 6.",
    "Duplicates -- Most of the commons and uncommons were duplicated.",
    "Cons: I got about 20 cards in Japanese, and a 18 duplicates of a single card, and several cards with more than 4 duplicates.",
    "Anyway, the number of duplicates was about what I expected.",
    "After reading through the reviews I was expecting there to be a fair amount of duplicates, but the number of duplicates in my set was beyond anything I read.",
    "After a second pass I found a bunch of other cards that had 15+ duplicates.",
    "= 194 total, 116 excluding duplicatesForest (green) = 234 total, 108 excluding duplicatesSwamp (black) = 225 total, 103 excluding duplicatesNeutral (any color) = 67 total, 37 excluding duplicatesMulti-colored = 65 total, 29 excluding duplicates---------------------------------------------Overall:  1005 total cards, 539 excluding duplicatesWoah!",
    "33 cards with between 5 and 10 duplicates.",
    ", all the duplicates were together and the cards were just thrown into the box, they were backwards and upside down and not all are near mint, a good number are lightly played.",
    "I'm not upset about the heavy duplicates on a few of the cards--they gave me 100 extra anyway.",
    "But now that I have had time to sort though it the amount of duplicates is outrageous.",
    "Nice collection of cards but so many duplicates",
    "Many multiple duplicates.  ",
    "There are a select few cards which takes up that 266 with a several duplicates of the same card making this kit impossible for someone starting out to build a decent deck.",
    "Fot the price i dont mind a few extra duplicates and I make many decks anyways so I can spread some cards over multiple decks",
    "Lots of duplicates (which wasn't unexpected).Here's the problem: 17 lands.",
    "One card had about 8 duplicates, most were 4 or under, some had 5-6.",
    "The only nice thing that happened was I got 6 mythic rares, 2 of which were duplicates.",
    "Almost 3\/4 of the box was duplicates.",
    "I'd suggest if your thinking about this be aware you will get duplicates and if you dont want that find a seller that promises MAX 4 cards duplicate.",
    "Recieved 1100+ cards the extra offsetting the 50+ foreign cards and any cards that had more than 4 duplicates.",
    "So, I got this hoping this was similar to other offers where I would receive a good mix of everything with not too many duplicates.",
    "Picked up full place sets for many cards with 4 duplicates being about the average.",
    "Now that doesnt seem bad only 4.5 duplicates of each right?",
    "Details:You're going to get a lot of lands, a lot with different art."
  ],
  "1973":[
    "Yes the cars smash into each other and fly off the track at times, but considering the speeds they travel at and how quickly they respond to commands, I'm amazed at how well they execute.",
    "Through magic (or science) the cars usually stay on the track, and can even figure out if you've placed them on the track facing the wrong direction.  ",
    "This set comes with two small cars that race at great speeds, stay on the track, and with an AI that actually tries to win.",
    "Even if you just run the cars around the track in AI mode, it&#8217;s pretty amazing, watching them adjust course to avoid one another, and to stay within the tracks.",
    "When I first got it I thought there was no way these cars are going to just stay on this track but they do.  ",
    "One update that I would like to see would be an actual slot car simulation, where you have to maintain your car on the track by controlling its speed through corners.",
    "Both my cars (piloted or AI) stopped somewhere on the track and generated a message &#34;place your car back on track&#34; or started spinning around like crazy.",
    "For the same amount of money, you can buy a fairly nice slot car set that will challenge hand eye coordination to keep that car on the track and racing with friends.",
    "The cars will stay 'on track' on their own - you don't need to worry about taking corners and such - but you control lane changes by tilting your device and fire weapons.",
    "You'll know the cars' wheels need cleaning because the cars will be very wobbly going around the corners, and often end up facing the wrong way on the track due to lack of traction.",
    "This is troublesome because the cars often end up completely off the track on the floor\/carpet.",
    "These cars are able to maneuver around you, skid off the track when killed, and even pull into the winner's circle if they win.",
    "However, after racing for a little while, my kids started getting frustrated that the cars would occasionally go into a spin and shoot off the track or end up heading the wrong direction, which they would quickly notice and reverse, but it was frustrating when your car would spin and start going the  wrong way.",
    "If you set the track on the floor I can't imagine crashing the cars hard enough to ever really damage them.",
    "While the cars keep themselves on the track, you get to control which imaginary lane they're in, their speed, and of course your offensive and defensive weapons.  ",
    "The cars eerily control themselves around the huge 4 foot by 8 foot track.  ",
    "You can control the speed of the car, but you don't have to worry about steering off the track.*",
    "The car will get itself around the track just fine",
    "The car automatically stays on the track when it should.  ",
    "Most of the time they do a pretty good job of staying on the track.",
    "It works well on the floor, and in the rare case that a car leaves the track, at least it doesn&#8217;t fall too.",
    "my cars race around and around flawlessly.",
    "The cars race around and around and rarely stray off course.",
    "After a very good tutorial and a few laps, you get the hang of it fairly easily as you drive around the track with precise control and incredible handling, I never spun it out, although I felt that the car had some limits to it like in the real world.",
    "Amazingly, the robot car knew exactly where I was on the track at any given moment.",
    "This allows to have precise movement as you drive around the track with your iPhone, iPad or iPod touch acting as the steering wheel.",
    "The weapons are pretty crude in function\/aim but do have enough precision to require some skill\/strategy to &#34;hit&#34; the other cars.",
    "The best part of slot car racing as a kid was when the cars would crash or fly off the track, right?  ",
    "Occasionally, if you crash them, or if you shoot one while in a turn, the car will go off-track, and a voice will prompt you to return the vehicle to the track, but otherwise, they stay on course.",
    "You actually see the cars going around the track &#8212; avoiding each other, shooting each other down, causing other cars to stop or spin off the road.",
    "We have cars that seem to lose their minds sometimes and head the wrong direction, and cars that go zooming off the track (problematic when playing on a table).  ",
    "True, the cars occasionally come off the track",
    "I myself have 3 cars and even with heavy use (and tons of collisions)",
    "App crashes frequently- then the cars freeze up mid-game*",
    "These are more challenging, especially the Crossroads which would often have cars collide into each other.",
    "Because the cars have extremely sticky tires, they pick up dust\/dirt\/hairs like CRAZY, so it's especially annoying to have the cars purposefully drive off onto the carpet.",
    "You need a BIIIIIIG table or if it's on the floor the track is quite likely to get stepped on.7.",
    "That really didn't pose any problems other than getting sand or dirt on the back of the track.",
    "In addition, users must keep the track itself free of dust and dirt for better traction.",
    "Dust and debris proved to be a bit of an issue when we left the track out for a few days.",
    "For $199 you get the starter kit including two cars, one track, and all the charging and cleaning gear to maintain the kit.",
    "Often you would see a car fly off the track and be told to return the car to the track.  ",
    "not sure if this is a flaw or a curiosity:  a couple of times, the cars do strange things, like doing a u-turn, or running off the mat.  ",
    "Clean the track and wheels when you see signs of the cars going off the track too regularly.  ",
    "Sometimes they will go off the track and will find they way back on, other times you will need to manually put it back on the track."
  ],
  "12905":[
    "You can tell by the opening that the game is not real also you can't migrate the content to the other games cause its fake",
    "Although it worked, there are many flaws with the game and it is obviously a fake, despite superficially seeming the same as any official copy.",
    "you answered no to any of these, you could have a fake copy!",
    "if you are unable to do those two things, this is a fake.(Firered and Leaf Green) Labels will not be metallic on legit copies, but they should be fairly shiny.",
    "When mine arrived, it was fairly evident that it was a fake.",
    "Total playtime: 2 hoursAlso noted the picture displayed for the product is a fake.",
    "Not a fake like some other ones on here.",
    "If you open it up it is clearly a fake.  ",
    "I was worried about Pokemon Emerald being a fake when purchased, but it wasn't!",
    "I just recently received my copy of \"pokemon emerald\" which is clearly a fake.",
    "If you can see it, it's fake.",
    "I  would recommend buying this game at a convention or at a used games store, if you buy it online make sure to check what the fake version looks like compared to the real one.",
    "Well beware of fake ones.",
    "Quickest way to spot a fake is a brand new label.",
    "However, you should be very wary of these games because, as some other reviewers have brought up, there are many fake copies circulating around the internet.",
    "So, after examining the cartridge from the picture and doing some comparisons to actual versions, you can clearly see that this is a fake Pokemon Emerald Version."
  ],
  "10301":[
    "But in throughout all those mmo's i've enjoyed this one the most, such an open world to explore, flows well with pre-existing elder scrolls games, and feels like a perfect mix between MMO and Single-player RPG.",
    "I like to stroll around and explore, but my understanding of MMO games is, that is limited due to leveling.",
    "ESO is a game that begs you to explore its massive world.",
    "I like the quests.  ",
    "If you like quests this is the game for you.",
    "If you like more quests, this game is really for you.",
    "they will give you a little side quest.",
    "The world opens up to you at max level, and you can explore all the deserts of Eleswyr and forests of Valenwood to your hearts content.",
    "When I got to Morrowind and starting exploring, that hook fully embedded itself.",
    "I love the graphics, the questing (can't believe I'm saying that), and the RVR.  ",
    "THis game actually rewards you xp for delving off the main road, and will throw unique, hand-crafted quests at you left and right.",
    "But there are several fun quests, and the game leans moe towards exploring than questing anyway.",
    "The wonder in this game is not in seeing how fast you can finish it, it's in exploring the details and quests in each new area that opens up.",
    "There is no end game, the only way to level up is quests.",
    "For those ES fans who may be a little meh about the MMO aspect, this game is comparable to other premium single-player RPGs in both storyline depth and replay value.",
    "If you dont like quests that much you will burn out just like I did 1 month after the game launched.",
    "That being said, some of the quests are pretty boring, typical MMO &#34;go for&#34; missions.",
    "If you like nothing but quests you might make it to the max veteran rank.",
    "meh game became boring.",
    "Clearly they are counting on a significant portion of the people who the people who get bored with this game to foget to cancel their subscriptions.  ",
    "I was hoping for a new mmo, something to give me a new world to be engaged in.",
    "Lets talk about PvP. An enormous battleground where 3 factions are going at it in a big way using siege, stealth and swordplay.",
    "Because Cyrodil is so large, it feels like you are actually taking part in a war, not some strange form of olympics (though to clarify, I do enjoy PvP battlegrounds found in other games as well).",
    "The sole PvP map is truly huge, accessible at very early level and may end up being my favorite part of this game, which I did not expect.",
    "With three factions duking it out in 90-day challenges over a zone map that rivals some other games' entire world, this promises to provide months of entertainment without being at all daunting to the beginner.",
    "From the superb voice acting, great graphics on ultra-high settings, and active combat that feels greater and more responsive that older TES games, I was instantly hooked.",
    "There is no atmosphere to the game at all because there tons of other players running around doing other stuff no matter where you go.  ",
    "Never has there been an mmo game more compelling to the story, more beautiful or more engaging.",
    "Besides quests, other game systems common to MMOs feel much more meaningful in  ESO.",
    "It has the right features for a game that I like to play -- an MMO that feels like a Single Player RPG -- it a perfect game for me.",
    "It's a good game, not a great game, but it's just different enough from some of the other MMO and MMO style games that I have played that it is interesting.",
    "However I feel like the graphics slipped a little from the realism of Skyrim into the un-realism of some other MMO's.",
    "Fine for an RPG, awful for an MMO, I can't even image what pvp is like.",
    "I'm a big fan of the Elder Scrolls series as well as MMOs like Guild Wars 2 and others.",
    "If you're looking for a good MMO then I would highly recommend Final Fantasy: A Real Reborn.",
    "Only complaint is the story plays just like a single player game when its an MMO",
    "I hope you can see that this game is its own type of beast, if you want a elder scrolls experience, you're out of luck; if you want a typical MMO experience, you won't really find it here.",
    "Its nothing like skyrim, just a generic MMO, DIFFERENT engine.  ",
    "Its skyrim meets rift or WoW, but better.  ",
    "I thought this would be Skyrim on a MMO scale.",
    "If you like the Elder Scrolls Franchise and you like MMOs then for goodness' sake buy the game.",
    "So whats $15 a month if your getting top quality content and gameplay that you would expect from an elder scrolls title, wrapped in the joys of tormenting other alliances in an MMO?",
    "This isn't just Skyrim with MMO added.",
    "this is a lot like other games like warcraft but it incorporates some classic elder scrolls features; nothing spectacular but worth playing.",
    "Leveling feels like your playing any single player Elder Scrolls.",
    "It will fail and become free to play just like the rest of them so don't waste your money yet and wait.",
    "You'll love this even if you never played an MMO and are hesitant, if you liked Skyrim, Oblivion, Redquard or Daggerfall, you'll love Elder Scrolls Online..",
    "It feels just like Oblivion.  ",
    "It feels just like Skyrim but multiplayer!",
    "In my opinion it has all of the polish that you would expect from Bethesda; I would put it up against any of those MMOs that I listed above.",
    "I've also played WOW, LOTR, and several other MMPORGs so I have a lot to compare this to.",
    "I have come to expect to be underwhelmed by most MMOs, but have been pleasantly surprised with TESO.",
    "As opposed to other mmos where you know exactly what you're up against every time you see a certain build, this game keeps you guessing and the UI & Mods don't allow you to skimp on skill."
  ]
}